{
    "kategori": "Kitab Sumpah dan Nadzar",
  "hadits": [
    {
                "number": 3701,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ الرُّهَاوِيُّ وَمُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ قَالَكَانَتْ يَمِينٌ يَحْلِفُ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَمُقَلِّبِ الْقُلُوبِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman Ar Ruhawi] dan [Musa bin 'Abdurrahman] mereka berkata; telah menceritakan kepada kami [Muhammad bin Bisyr] berkata; telah menceritakan kepada kami [Sufyan] dari [Musa bin 'Uqbah] dari [Salim bin Abdullah bin Umar] dari [Ibnu Umar] berkata, \"Sumpah yang biasa diucapkan Rasulullah shallallahu 'alaihi wasallam adalah 'Tidak, demi Dzat yang membolak-balikkan hati'.\""
            },
            {
                "number": 3702,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ أَبُو يَعْلَى قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ عَنْ عَبَّادِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَكَانَتْ يَمِينُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّتِي يَحْلِفُ بِهَا لَا وَمُصَرِّفِ الْقُلُوبِ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Yahya bin Abdullah] berkata; telah menceritakan kepada kami [Muhammad bin Ash Shalt Abu Ya'la] berkata; telah menceritakan kepada kami [Abdullah bin Raja`] dari ['Abbad bin Ishaq] dari [Az Zuhri] dari [Salim] dari [ayahnya] berkata, \"Sumpah yang biasa Rasulullah shallallahu 'alaihi wasallam diucapkan adalah 'Tidak, demi Dzat yang memalingkan hati'.\""
            },
            {
                "number": 3703,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ وَالنَّارَ أَرْسَلَ جِبْرِيلَ عَلَيْهِ السَّلَام إِلَى الْجَنَّةِ فَقَالَ انْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا فَنَظَرَ إِلَيْهَا فَرَجَعَ فَقَالَ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا فَأَمَرَ بِهَا فَحُفَّتْ بِالْمَكَارِهِ فَقَالَ اذْهَبْ إِلَيْهَا فَانْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا فَنَظَرَ إِلَيْهَا فَإِذَا هِيَ قَدْ حُفَّتْ بِالْمَكَارِهِ فَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ قَالَ اذْهَبْ فَانْظُرْ إِلَى النَّارِ وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا فَنَظَرَ إِلَيْهَا فَإِذَا هِيَ يَرْكَبُ بَعْضُهَا بَعْضًا فَرَجَعَ فَقَالَ وَعِزَّتِكَ لَا يَدْخُلُهَا أَحَدٌ فَأَمَرَ بِهَا فَحُفَّتْ بِالشَّهَوَاتِ فَقَالَ ارْجِعْ فَانْظُرْ إِلَيْهَا فَنَظَرَ إِلَيْهَا فَإِذَا هِيَ قَدْ حُفَّتْ بِالشَّهَوَاتِ فَرَجَعَ وَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَنْجُوَ مِنْهَا أَحَدٌ إِلَّا دَخَلَهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] berkata; telah memberitakan kepada kami [Al Fadll bin Musa] berkata; telah menceritakan kepadaku [Muhammad bin 'Amru] berkata; telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tatkala Allah menciptakan Surga dan Neraka Dia mengirim Jibril 'alaihissalam ke Surga seraya berfirman: 'Lihatlah ke dalamnya dan apa yang telah Aku persiapkan untuk penghuninya' Kemudian Jibril melihat ke surga dan kembali seraya berkata, 'Demi kemuliaan-Mu, sungguh tidak ada seorangpun yang mendengarnya kecuali ia akan memasukinya.' Kemudian Allah memerintahkan (untuk menutupi surga dengan sesuatu yang dibenci), maka ditutupilah surga dengan sesuatu yang dibenci (oleh manusia). Allah lalu berfirman: 'Pergilah ke Surga dan lihatlah kepadanya dan apa yang telah Aku persiapkan untuk penghuninya.' Kemudian Jibril melihat kepadanya, ternyata Surga telah dikelilingi dengan perkara-perkara yang tidak menyenangkan. Jibril lalu berkata, \"Demi kemulian-Mu, sungguh aku khawatir tidak akan ada seorangpun yang akan memasukinya.' Allah kemudian berfirman: 'Pergi dan lihatlah ke dalam neraka dan kepada apa yang telah Aku persiapkan untuk penghuninya.' Kemudian ia melihat kepadanya dan ternyata sebagiannya berada di atas sebagian yang lain. Kemudian Jibril kembali dan berkata, 'Demi kemulian-Mu, tidak akan ada seorangpun yang memasukinya.' Kemudian Allah memerintahkan (untuk menutupi neraka dengan sesuatu yang menyenangkan), lalu ditutupilah neraka dengan hal yang menyenangkan nafsu syahwat. Lalu Allah berfirman; 'Lihatlah ke dalamnya.' Ternyata ia dikelilingi dengan nafsu syahwat, kemudian Jibril kembali dan berkata, 'Demi kemuliaan-Mu, sungguh aku khawatir tidak akan ada seorangpun yang selamat darinya kecuali ia pasti akan memasukinya'.\""
            },
            {
                "number": 3704,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ جَعْفَرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ حَالِفًا فَلَا يَحْلِفْ إِلَّا بِاللَّهِ وَكَانَتْ قُرَيْشٌ تَحْلِفُ بِآبَائِهَا فَقَالَ لَا تَحْلِفُوا بِآبَائِكُمْ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dari [Isma'il] -yaitu Abu Ja'far- berkata; telah menceritakan kepada kami [Abdullah bin Dinar] dari [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah maka hendaknya ia tidak bersumpah kecuali dengan Allah, dan dahulu orang-orang Quraisy bersumpah dengan nama bapak-bapak mereka.\" Kemudian beliau bersabda: \"Janganlah bersumpah dengan nama bapak-bapak kalian.\""
            },
            {
                "number": 3705,
                "arab": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ قَالَ حَدَّثَنِي رَجُلٌ مِنْ بَنِي غِفَارٍ فِي مَجْلِسِ سَالِمِ بْنِ عَبْدِ اللَّهِ قَالَ سَالِمُ بْنُ عَبْدِ اللَّهِ سَمِعْتُ عَبْدَ اللَّهِ يَعْنِي ابْنَ عُمَرَ وَهُوَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] berkata; telah menceritakan kepada kami [Ibnu 'Aliyyah] berkata; telah menceritakan kepada kami [Yahya bin Abu Ishaq] berkata; telah menceritakan kepadaku [seorang laki-laki Bani Ghifar] dalam majelis Salim bin Abdullah, [Salim bin Abdullah] berkata; aku mendengar [Abdullah] -yaitu Ibnu Umar- berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah melarang kalian untuk bersumpah dengan nama bapak-bapak kalian.\""
            },
            {
                "number": 3706,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّهُ سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمَرَ مَرَّةً وَهُوَ يَقُولُ وَأَبِي وَأَبِي فَقَالَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلَا آثِرًا",
                "id": "Telah mengabarkan kepada kami ['Ubaidullah bin Sa'id], dan [Qutaibah bin Sa'id] dan lafazhnya adalah lafazh Qutaibah, mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [ayahnya], bahwa suatu kali Nabi shallallahu 'alaihi wasallam mendengar Umar berkata, \"Demi ayahku. Demi ayahku.\" Maka beliau pun bersabda: \"Sesungguhnya Allah melarang kalian bersumpah dengan nama bapak-bapak kalian.\" Umar berkata, \"Demi Allah, setelah itu aku tidak pernah bersumpah dengannya baik menyebutkannya ataupun menceritakannya.\""
            },
            {
                "number": 3707,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْقَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلَا آثِرًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid] dan [Sa'id bin 'Abdurrahman] dan lafazhnya adalah lafazh Sa'id, mereka berdua berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [ayahnya] dari [Umar] bahwa nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah melarang kalian untuk bersumpah dengan bapak-bapak kalian.\" Umar berkata, \"Demi Allah, aku tidak bersumpah dengannya sejak itu, baik dengan menyebutkan maupun menceritakan.\""
            },
            {
                "number": 3708,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ قَالَ أَنْبَأَنَا مُحَمَّدٌ وَهُوَ ابْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّهُ أَخْبَرَهُ عَنْ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْقَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا بَعْدُ ذَاكِرًا وَلَا آثِرًا",
                "id": "Telah mengabarkan kepada kami ['Amru bin Utsman bin Sa'id] berkata; telah memberitakan kepada kami [Muhammad] -yaitu Ibnu Harb- dari [Az Zubaidi] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa ia mengabarkan kepadanya, dari [Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah melarang kalian untuk bersumpah dengan bapak-bapak kalian.\" Umar berkata, \"Demi Allah, aku tidak bersumpah dengannya sejak itu, baik dengan menyebutkan maupun menceritakan.\""
            },
            {
                "number": 3709,
                "arab": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا عَوْفٌ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحْلِفُوا بِآبَائِكُمْ وَلَا بِأُمَّهَاتِكُمْ وَلَا بِالْأَنْدَادِ وَلَا تَحْلِفُوا إِلَّا بِاللَّهِ وَلَا تَحْلِفُوا إِلَّا وَأَنْتُمْ صَادِقُونَ",
                "id": "Telah mengabarkan kepada kami [Abu Bakr bin Ali] berkata; telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] berkata; telah menceritakan kepada kami [ayahku] berkata; telah menceritakan kepada kami ['Auf] dari [Muhammad bin Sirin] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian bersumpah dengan ayah dan ibu kalian, atau dengan barhala-berhala, dan janganlah kalian bersumpah kecuali kalian jujur.\""
            },
            {
                "number": 3710,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ خَالِدٍ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا خَالِدٌ عَنْ أَبِي قِلَابَةَ عَنْ ثَابِتِ بْنِ الضَّحَّاكِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ بِمِلَّةٍ سِوَى الْإِسْلَامِ كَاذِبًا فَهُوَ كَمَا قَالَ قَالَ قُتَيْبَةُ فِي حَدِيثِهِ مُتَعَمِّدًا وَقَالَ يَزِيدُ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ عَذَّبَهُ اللَّهُ بِهِ فِي نَارِ جَهَنَّمَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] berkata; telah menceritakan kepada kami [Ibnu Abu Adi] dari [Khalid]. (dalam jalur lain disebutkan) Dan telah memberitakan kepada kami [Muhammad bin Abdullah bin Bazi'] berkata; telah menceritakan kepada kami [Yazid] berkata; telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dari [Tsabit bin Adh Dhahhak] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan agama selain Islam secara dusta, maka berlaku seperti apa yang ia katakan.\" [Qutaibah] menyebutkan dalam haditsnya; 'dengan sengaja.' Sedangkan [Yazid] menyebutkan, 'dengan dusta, maka berlaku seperti apa yang ia ucapkan. Dan barangsiapa membunuh dirinya dengan sesuatu maka Allah akan menyiksanya dengan sesuatu tersebut di Neraka Jahannam.\""
            },
            {
                "number": 3711,
                "arab": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا أَبُو عَمْرٍو عَنْ يَحْيَى أَنَّهُ حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو قِلَابَةَ قَالَ حَدَّثَنِي ثَابِتُ بْنُ الضَّحَّاكِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ بِمِلَّةٍ سِوَى الْإِسْلَامِ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ عُذِّبَ بِهِ فِي الْآخِرَةِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Khalid] berkata; telah menceritakan kepada kami [Al Walid] berkata; telah menceritakan kepada kami [Abu 'Amru] dari [Yahya] bahwa ia menceritakan kepadanya, ia berkata; telah menceritakan kepadaku [Abu Qilabah] berkata; telah menceritakan kepadaku [Tsabit bin Adl Dlahhak], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda; \"Barangsiapa bersumpah dengan agama selain Islam secara dusta, maka berlaku seperti apa yang ia katakan. Dan barangsiapa membunuh dirinya dengan sesuatu maka ia akan disiksa di Akhirat.\""
            },
            {
                "number": 3712,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ إِنِّي بَرِيءٌ مِنْ الْإِسْلَامِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا لَمْ يَعُدْ إِلَى الْإِسْلَامِ سَالِمًا",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Huraits] berkata; telah menceritakan kepada kami [Al Fadll bin Musa] dari [Husain bin Waqid] dari [Abdullah bin Buraidah] dari [ayahnya] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengatakan, 'Aku berlepas diri dari Islam', apabila ia berdusta maka berlaku seperti apa yang ia katakan, dan apabila berkata benar maka ia tidak akan kembali kepada Islam dalam keadaan selamat.\""
            },
            {
                "number": 3713,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى قَالَ حَدَّثَنَا مِسْعَرٌ عَنْ مَعْبَدِ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ عَنْ قُتَيْلَةَ امْرَأَةٍ مِنْ جُهَيْنَةَأَنَّ يَهُودِيًّا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّكُمْ تُنَدِّدُونَ وَإِنَّكُمْ تُشْرِكُونَ تَقُولُونَ مَا شَاءَ اللَّهُ وَشِئْتَ وَتَقُولُونَ وَالْكَعْبَةِ فَأَمَرَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادُوا أَنْ يَحْلِفُوا أَنْ يَقُولُوا وَرَبِّ الْكَعْبَةِ وَيَقُولُونَ مَا شَاءَ اللَّهُ ثُمَّ شِئْتَ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Isa] berkata; telah menceritakan kepada kami [Al Fadll bin Musa] berkata; telah menceritakan kepada kami [Mis'ar] dari [Ma'bad bin Khalid] dari [Abdullah bin Yasar] dari [Qutailah] seorang wanita dari Juhainah, bahwa seorang Yahudi datang kepada Nabi shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Sesungguhnya kalian membuat tandingan, dan sungguh kalian telah berbuat syirik. Kalian mengatakan, 'Atas kehendak Allah dan kehendak kamu'. Dan kalian katakan, 'Demi Ka'bah'.\" Kemudian Nabi shallallahu 'alaihi wasallam memerintahkan para sahabat apabila hendak bersumpah untuk mengucapkan, 'Demi Tuhan Pemilik Ka'bah', dan mengucapkan, 'Atas kehendak Allah, kemudian atas kehendak kamu'.\""
            },
            {
                "number": 3714,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا هِشَامٌ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَحْلِفُوا بِآبَائِكُمْ وَلَا بِالطَّوَاغِيتِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] berkata; telah menceritakan kepada kami [Yazid] berkata; telah memberitakan kepada kami [Hisyam] dari [Al Hasan] dari ['Abdurrahman bin Samurah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah bersumpah dengan bapak-bapak kalian dan dengan sesembahan selain Allah.\""
            },
            {
                "number": 3715,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ مِنْكُمْ فَقَالَ بِاللَّاتِ فَلْيَقُلْ لَا إِلَهَ إِلَّا اللَّهُ وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ فَلْيَتَصَدَّقْ",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid] berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian bersumpah dan berkata 'Demi Lata', maka hendaknya ia mengatakan, 'LAA ILAAHA ILLALLAAH (Tidak ada tuhan yang berhak disembah selain Allah) '. Dan barangsiapa berkata kepada sahabatnya, 'Kemarilah aku akan mengundi (judi) kamu', maka hendaknya ia bersedekah.\""
            },
            {
                "number": 3716,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَكُنَّا نَذْكُرُ بَعْضَ الْأَمْرِ وَأَنَا حَدِيثُ عَهْدٍ بِالْجَاهِلِيَّةِ فَحَلَفْتُ بِاللَّاتِ وَالْعُزَّى فَقَالَ لِي أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَ مَا قُلْتَ ائْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبِرْهُ فَإِنَّا لَا نَرَاكَ إِلَّا قَدْ كَفَرْتَ فَأَتَيْتُهُ فَأَخْبَرْتُهُ فَقَالَ لِي قُلْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ثَلَاثَ مَرَّاتٍ وَتَعَوَّذْ بِاللَّهِ مِنْ الشَّيْطَانِ ثَلَاثَ مَرَّاتٍ وَاتْفُلْ عَنْ يَسَارِكَ ثَلَاثَ مَرَّاتٍ وَلَا تَعُدْ لَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Daud] berkata; telah menceritakan kepada kami [Al Hasan bin Muhammad] berkata; telah menceritakan kepada kami [Zuhair] berkata; telah menceritakan kepada kami [Abu Ishaq] dari [Mush'ab bin Sa'd] dari [ayahnya] berkata, \"Kami pernah mengingat sebagian perkara dan aku baru keluar dari masa jahiliyah, kemudian aku bersumpah dengan Lata dan 'Uzza. Lalu para sahabat Rasulullah shallallahu 'alaihi wasallam berkata kepadaku, \"Sungguh buruk apa yang engkau katakan. Datanglah kepada Rasulullah shallallahu 'alaihi wasallam dan kabarkan kepadanya, sungguh kami tidak melihat kecuali engkau telah kafir.\" Kemudian aku datang kepada beliau dan mengabarkan hal itu, maka beliau pun bersabda: \"Katakanlah, 'LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAH (Tidak ada tuhan yang berhak disembah selain Allah, dan tidak ada sekutu bagi-Nya) ' tiga kali dan berlindunglah engkau kepada Allah dari setan tiga kali, lalu meludahlah ke samping kirimu sebanyak tiga kali dan jangan engkau ulangi lagi (perbuatanmu).\""
            },
            {
                "number": 3717,
                "arab": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِيهِ قَالَ حَدَّثَنِي مُصْعَبُ بْنُ سَعْدٍ عَنْ أَبِيهِ قَالَحَلَفْتُ بِاللَّاتِ وَالْعُزَّى فَقَالَ لِي أَصْحَابِي بِئْسَ مَا قُلْتَ قُلْتَ هُجْرًا فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ قُلْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَانْفُثْ عَنْ يَسَارِكَ ثَلَاثًا وَتَعَوَّذْ بِاللَّهِ مِنْ الشَّيْطَانِ ثُمَّ لَا تَعُدْ",
                "id": "Telah mengabarkan kepada kami [Abdul Hamid bin Muhammad] berkata; telah menceritakan kepada kami [Makhlad] berkata; telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [ayahnya] berkata; telah menceritakan kepadaku [Mush'ab bin Sa'd] dari [ayahnya] ia berkata, \"Aku bersumpah dengan Lata dan 'Uzza, kemudian para sahabatku mengatakan, 'Sungguh buruk apa yang engkau katakan! ' Kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepadanya. Maka beliau bersabda: \"Katakanlah, 'LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKA LAHU LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAIN QADIIR (Tidak ada tuhan yang berhak untuk disembah selain Allah semata, yang tidak ada sekutu bagi-Nya, bagi-Nya kerajaan dan pujian. Dan dia mampu atas segala sesuatu) '. Lalu meludahlah ke kirimu sebanyak tiga kali, kemudian berlindunglah kepada Allah dari setan dan jangan kamu ulangi lagi (perbuatanmu).\""
            },
            {
                "number": 3718,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْأَشْعَثِ بْنِ سُلَيْمٍ عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَائِزِ وَعِيَادَةِ الْمَرِيضِ وَتَشْمِيتِ الْعَاطِسِ وَإِجَابَةِ الدَّاعِي وَنَصْرِ الْمَظْلُومِ وَإِبْرَارِ الْقَسَمِ وَرَدِّ السَّلَامِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] dan [Muhammad] berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Asy'ats bin Sulaim] dari [Mu'awiyah bin Suwaid bin Muqarrin] dari [Al Bara` bin 'Azib] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk melakukan tujuh perkara; mengantarkan jenazah, menjenguk orang sakit, menjawab orang yang bersin, memenuhi orang yang mengundang, menolong orang yang dizhalimi, berbuat baik saat membagi, dan membalas salam.\""
            },
            {
                "number": 3719,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ عَنْ أَبِي السَّلِيلِ عَنْ زَهْدَمٍ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا عَلَى الْأَرْضِ يَمِينٌ أَحْلِفُ عَلَيْهَا فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلَّا أَتَيْتُهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] berkata; telah menceritakan kepada kami [Ibnu Adi] dari [Sulaiman] dari [Abu As Salil] dari [Zahdam] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada di atas bumi ini sumpah yang aku ucapkan lalu aku melihat ada yang lebih baik darinya kecuali aku akan mendatanginya (melakukannya).\""
            },
            {
                "number": 3720,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ الْأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ وَاللَّهِ لَا أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ ثُمَّ لَبِثْنَا مَا شَاءَ اللَّهُ فَأُتِيَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلَاثِ ذَوْدٍ فَلَمَّا انْطَلَقْنَا قَالَ بَعْضُنَا لِبَعْضٍ لَا يُبَارِكُ اللَّهُ لَنَا أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَسْتَحْمِلُهُ فَحَلَفَ أَنْ لَا يَحْمِلَنَا قَالَ أَبُو مُوسَى فَأَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ مَا أَنَا حَمَلْتُكُمْ بَلْ اللَّهُ حَمَلَكُمْ إِنِّي وَاللَّهِ لَا أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلَّا كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] berkata; telah menceritakan kepada kami [Hammad] dari [Ghailan bin Jarir] dari [Abu Burdah] dari [Abu Musa Al Asy'ari] berkata, \"Aku datang kepada Rasulullah shallallahu 'alaihi wasallam bersama beberapa orang Asy'ari meminta agar beliau bisa membawa kami. Kemudian beliau bersabda: \"Demi Allah, aku tidak dapat membawa kalian dan tidak memiliki sesuatu yang dapat membawa kalian.\" Kemudian kami tinggal selama yang dikehendaki Allah. Kemudian beliau diberi unta dan memerintahkan agar kami diberi tiga unta. Kemudian tatkala kami pergi sebagian kami berkata kepada sebagian yang lain, 'Allah tidak memberikan berkah kepada kita, kita datang kepada Rasulullah shallallahu 'alaihi wasallam meminta sesuatu yang dapat membawa kita, kemudian beliau bersumpah untuk tidak membawa kita.' Abu Musa berkata, \"Kemudian kami datang kepada Nabi shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepadanya. Kemudian beliau bersabda: \"Aku tidak membawa kalian akan tetapi Allah yang membawa kalian. Demi Allah, aku tidak bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik darinya kecuali aku membatalkan sumpahku dan melakukan sesuatu yang lebih baik.\""
            },
            {
                "number": 3721,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ قَالَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَأْتِ الَّذِي هُوَ خَيْرٌ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] berkata; telah menceritakan kepada kami [Yahya] dari ['Ubaidullah bin Al Akhnas] berkata; telah menceritakan kepada kami ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik darinya, maka hendaknya ia membayar kafarah sumpahnya dan melakukan sesuatu yang lebih baik.\""
            },
            {
                "number": 3722,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا حَلَفَ أَحَدُكُمْ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَنْظُرْ الَّذِي هُوَ خَيْرٌ فَلْيَأْتِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] berkata; telah menceritakan kepada kami [Al Mu'tamir] dari [ayahnya] dari [Al Hasan] dari ['Abdurrahman bin Samurah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang di antara kalian bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik darinya, maka hendaknya ia membayar kafarah sumpahnya dan melakukan hal yang lebih baik.\""
            },
            {
                "number": 3723,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَكَفِّرْ عَنْ يَمِينِكَ ثُمَّ ائْتِ الَّذِي هُوَ خَيْرٌ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] berkata; telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Jarir bin Hazim] berkata; aku mendengar [Al Hasan] berkata; telah menceritakan kepada kami ['Abdurrahman bin Samurah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau bersumpah dengan suatu sumpah, maka hendaklah kamu bayar kafarah sumpahmu kemudian lakukan yang lebih baik.\""
            },
            {
                "number": 3724,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ عَنْ عَبْدِ الْأَعْلَى وَذَكَرَ كَلِمَةً مَعْنَاهَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya Al Qutha'I] dari [Abdul A'la] -dan ia menyebutkan sebuah kalimat yang maknanya- telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari ['Abdurrahman bin Samurah], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila engkau bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik darinya, maka hendaklah kamu bayar kafarah sumpahmu dan lakukan sesuatu yang lebih baik.\""
            },
            {
                "number": 3725,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] berkata; telah menceritakan kepada kami ['Abdurrahman] berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] berkata; aku mendengar [Abdullah bin 'Amru] mantan budak Al Hasan bin Ali, menceritakan dari [Adi bin Hatim] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik darinya, maka hendaknya ia melakukan sesuatu yang lebih baik dan membayar kafarah sumpahnya.\""
            },
            {
                "number": 3726,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَدَعْ يَمِينَهُ وَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْهَا",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Abu Bakr bin 'Ayyasy] dari [Abdul Aziz bin Rafi'] dari [Tamim bin Tharafah] dari [Adi bin Hatim] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik darinya, maka hendaknya ia meninggalkan sumpahnya dan melakukan sesuatu yang lebih baik serta membayar kafarah sumpahnya.\""
            },
            {
                "number": 3727,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ قَالَ سَمِعْتُ تَمِيمَ بْنَ طَرَفَةَ يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيَتْرُكْ يَمِينَهُ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Yazid] berkata; telah menceritakan kepada kami [Bahz bin Asad] berkata; telah menceritakan kepada kami [Syu'bah] berkata; telah mengabarkan kepada kami [Abdul Aziz bin Rafi'] berkata; aku mendengar [Tamim bin Tharafah] menceritakan dari [Adi bin Hatim] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik, maka hendaknya ia melakukan sesuatu yang lebih baik dan meninggalkan sumpahnya.\""
            },
            {
                "number": 3728,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنَا أَبُو الزَّعْرَاءِ عَنْ عَمِّهِ أَبِي الْأَحْوَصِ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ ابْنَ عَمٍّ لِي أَتَيْتُهُ أَسْأَلُهُ فَلَا يُعْطِينِي وَلَا يَصِلُنِي ثُمَّ يَحْتَاجُ إِلَيَّ فَيَأْتِينِي فَيَسْأَلُنِي وَقَدْ حَلَفْتُ أَنْ لَا أُعْطِيَهُ وَلَا أَصِلَهُ فَأَمَرَنِي أَنْ آتِيَ الَّذِي هُوَ خَيْرٌ وَأُكَفِّرَ عَنْ يَمِينِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] berkata; telah menceritakan kepada kami [Abu Az Za'ra`] dari pamannya [Abu Al Ahwash] dari [ayahnya] berkata, \"Aku berkata, \"Wahai Rasulullah, bagaimana pendapatmu mengenai anak pamanku, aku datang dan berharap kepadanya namun ia tidak memberiku, bahkan ia tidak menyambung kekerabatan denganku. Kemudian ia butuh pertolonganku, ia datang dan meminta kepadaku? Sedangkan aku telah bersumpah untuk tidak memberinya dan tidak menyambung hubungan kekerabatan dengannya.\" Kemudian beliau memerintahkan aku agar melakukan yang lebih baik dan membatalkan sumpahku.\""
            },
            {
                "number": 3729,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ وَيُونُسُ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا آلَيْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] berkata; telah menceritakan kepada kami [Husyaim] berkata; telah memberitakan kepada kami [Manshur] dan [Yunus] dari [Al Hasan] dari ['Abdurrahman bin Samurah] berkata, \"Nabi shallallahu 'alahi wa sallam bersabda kepadaku: \"Apabila engkau bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik, maka hendaknya engkau melakukan sesuatu yang lebih baik dan bayarlah kafarah sumpahmu.\""
            },
            {
                "number": 3730,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَقَالَ يَعْنِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ مِنْهَا وَكَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] berkata; telah menceritakan kepada kami [Yahya] berkata; telah menceritakan kepada kami [Ibnu 'Aun] dari [Al Hasan] dari ['Abdurrahman bin Samurah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik, maka hendaknya engkau melakukan sesuatu yang lebih baik dan bayarlah kafarah sumpahmu.\""
            },
            {
                "number": 3731,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ فِي حَدِيثِهِ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ الْحَسَنِ الْبَصْرِيِّ قَالَ عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dalam haditsnya, dari [Jarir] dari [Manshur] dari [Al Hasan Al Bashri], ['Abdurrahman bin Samurah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Apabila engkau bersumpah dengan suatu sumpah kemudian melihat yang lainnya lebih baik darinya, maka hendaknya engkau melakukan sesuatu yang lebih baik dan membatalkan sumpahmu.\""
            },
            {
                "number": 3732,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ قَالَ أَخْبَرَنِي عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ وَلَا يَمِينَ فِيمَا لَا تَمْلِكُ وَلَا فِي مَعْصِيَةٍ وَلَا قَطِيعَةِ رَحِمٍ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Muhammad] berkata; telah menceritakan kepada kami [Yahya] dari ['Ubaidullah bin Al Akhnas] berkata; telah mengabarkan kepadaku ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nadzar dan tidak ada sumpah dalam perkara yang tidak engkau miliki, tidak dalam kemaksiatan dan tidak dalam memutuskan hubungan kekerabatan.\""
            },
            {
                "number": 3733,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ فَاسْتَثْنَى فَإِنْ شَاءَ مَضَى وَإِنْ شَاءَ تَرَكَ غَيْرَ حَنِثٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sa'id] berkata; telah menceritakan kepada kami [Habban] berkata; telah menceritakan kepada kami [Abdul Warits] berkata; telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alahi wa sallam, beliau bersabda: \"Barangsiapa bersumpah kemudian mengecualikan, apabila ia menghendaki maka ia teruskan dan apabila menghendaki maka ia meninggalkannya tanpa ada dosa.\""
            },
            {
                "number": 3734,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ حَيَّانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ عَنْ عُمَرَ بْنِ الْخَطَّابِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا الْأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لِامْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] berkata; telah memberitakan kepada kami [Sulaiman bin Hayyan] berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] dari ['Alqamah bin Waqqash] dari [Umar bin Al Khathab] dari Nabi shallallahu 'alahi wa sallam, beliau bersabda: \"Hanyasanya amalan itu tergantung pada niatnya, dan setiap orang akan mendapatkan sebagaimana yang ia niatkan. Barangsiapa hijrahnya kepada Allah dan rasul-Nya maka hijrahnya kepada Allah dan rasul-Nya, dan barangsiapa hijrahnya untuk dunia atau wanita yang akan dinikahinya maka hijrahnya kepada apa yang hijrah kepadanya.\""
            },
            {
                "number": 3735,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ زَعَمَ عَطَاءٌ أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُسَمِعْتُ عَائِشَةَ تَزْعُمُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ فَيَشْرَبُ عِنْدَهَا عَسَلًا فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتُنَا دَخَلَ عَلَيْهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْتَقُلْ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ أَكَلْتَ مَغَافِيرَ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ ذَلِكَ لَهُ فَقَالَ لَا بَلْ شَرِبْتُ عَسَلًا عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ وَلَنْ أَعُودَ لَهُ فَنَزَلَتْ{ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ إِلَى إِنْ تَتُوبَا إِلَى اللَّهِ }عَائِشَةُ وَحَفْصَةُ{ وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا }لِقَوْلِهِ بَلْ شَرِبْتُ عَسَلًا",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Muhammad Az Za'farani] berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] berkata; ['Atha] mengaku bahwa ia mendengar ['Ubaid bin 'Umair] berkata; aku mendengar [Aisyah] mengaku, bahwa Nabi shallallahu 'alahi wa sallam pernah tinggal di rumah Zainab binti Jahsy kemudian minum madu di rumahnya. Lalu aku dan Hafshah bersepakat bahwa siapapun di antara kami yang ditemui Nabi shallallahu 'alahi wa sallam maka hendaknya ia berkata, 'Sesungguhnya aku mencium bau Maghafir (sejenis tumbuhan), engkau telah makan Maghafir.' Kemudian beliau menemui salah seorang di antara mereka berdua sehingga salah seorang dari mereka mengatakan perkataan tersebut kepada beliau. Kemudian beliau bersabda: \"Tidak, melainkan aku minum madu di rumah Zainab binti Jahsy, dan aku tidak akan mengulanginya.\" Kemudian turunlah ayat: '(Hai Nabi kenapa engkau haramkan apa yang Allah halalkan kepadamu) hingga firman-Nya (Jika kamu berdua bertaubat kepada Allah…) ' (Qs. AT Tahriim: 1-4), yaitu Aisyah dan Hafshah, serta ayat: '(Dan ingatlah ketika Nabi membicarakan secara rahasia kepada salah seorang isterinya (Hafsah) suatu peristiwa…) ' (Qs. At Tahriim: 3), yaitu karena perkataan beliau: 'melainkan aku minum madu'.\""
            },
            {
                "number": 3736,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا طَلْحَةُ بْنُ نَافِعٍ عَنْ جَابِرٍ قَالَدَخَلْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتَهُ فَإِذَا فِلَقٌ وَخَلٌّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلْ فَنِعْمَ الْإِدَامُ الْخَلُّ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] berkata; telah menceritakan kepada kami [Yahya] berkata; telah menceritakan kepada kami [Al Mutsanna bin Sa'id] berkata; telah menceritakan kepada kami [Thalhah bin Nafi'] dari [Jabir] berkata, \"Aku bersama Nabi shallallahu 'alahi wa sallam memasuki rumahnya, dan ternyata di dalam ada sepotong roti dan cuka, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanlah, lauk yang paling enak adalah cuka.\""
            },
            {
                "number": 3737,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا نُسَمَّى السَّمَاسِرَةَ فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَبِيعُ فَسَمَّانَا بِاسْمٍ هُوَ خَيْرٌ مِنْ اسْمِنَا فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّ هَذَا الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَالْكَذِبُ فَشُوبُوا بَيْعَكُمْ بِالصَّدَقَةِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin 'Abdurrahman] berkata; telah menceritakan kepada kami [Sufyan] dari [Abdul Malik] dari [Abu Wail] dari [Qais bin Abu Gharazah] berkata, \"Kami dahulu dipanggil dengan sebutan samasirah (para calo), kemudian Rasulullah shallallahu 'alaihi wasallam datang kepada kami dan kami sedang berjualan, maka beliau pun menamakan kami dengan nama yang lebih baik daripada nama kami. Beliau bersabda: \"Wahai para pedagang, sesungguhnya perdagangan ini dihadiri oleh orang yang bersumpah dan pendusta maka campurlah perdagangan kalian dengan sedekah.\""
            },
            {
                "number": 3738,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ سُفْيَانَ عَنْ عَبْدِ الْمَلِكِ وَعَاصِمٌ وَجَامِعٌ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا نَبِيعُ بِالْبَقِيعِ فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنَّا نُسَمَّى السَّمَاسِرَةَ فَقَالَ يَا مَعْشَرَ التُّجَّارِ فَسَمَّانَا بِاسْمٍ هُوَ خَيْرٌ مِنْ اسْمِنَا ثُمَّ قَالَ إِنَّ هَذَا الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَالْكَذِبُ فَشُوبُوهُ بِالصَّدَقَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid] dari [Sufyan] dari [Abdul Malik] ['Ashim] dan [Jami'] dari [Abu Wail] dari [Qais bin Abu Gharazah] berkata, \"Kami berjual beli di Baqi', kemudian Rasulullah shallallahu 'alaihi wasallam mendatangi kami, kami dahulu dipanggil dengan sebutan para calo, kemudian beliau bersabda: \"Wahai para pedagang, \" kemudian beliau menamai kami dengan nama yang lebih baik daripada nama kami. Beliau bersabda: \"Sesungguhnya perdagangan ini dihadiri orang yang bersumpah dan pendusta, maka campurkanlah perdagangan tersebut dengan sedekah.\""
            },
            {
                "number": 3739,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُغِيرَةَ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَأَتَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي السُّوقِ فَقَالَ إِنَّ هَذِهِ السُّوقَ يُخَالِطُهَا اللَّغْوُ وَالْكَذِبُ فَشُوبُوهَا بِالصَّدَقَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Mughirah] dari [Abu Wail] dari [Qais bin Abi Gharazah] berkata, \"Nabi shallallahu 'alahi wa sallam mendatangi kami saat kami sedang berada di pasar, kemudian beliau bersabda: \"Sesungguhnya pasar ini bercampur dengan perbuatan sia-sia dan kedustaan, maka campurlah dengan sedekah.\""
            },
            {
                "number": 3740,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ وَمُحَمَّدُ بْنُ قُدَامَةَ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا بِالْمَدِينَةِ نَبِيعُ الْأَوْسَاقَ وَنَبْتَاعُهَا وَكُنَّا نُسَمِّي أَنْفُسَنَا السَّمَاسِرَةَ وَيُسَمِّينَا النَّاسُ فَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَسَمَّانَا بِاسْمٍ هُوَ خَيْرٌ مِنْ الَّذِي سَمَّيْنَا أَنْفُسَنَا وَسَمَّانَا النَّاسُ فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّهُ يَشْهَدُ بَيْعَكُمْ الْحَلِفُ وَالْكَذِبُ فَشُوبُوهُ بِالصَّدَقَةِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dan [Muhammad bin Qudamah] mereka berdua berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wail] dari [Qais bin Abu Gharazah] berkata, \"Kami pernah berada di Madinah menjual beberapa wasaq makanan dan membelinya. Dan kami menamai diri kami dengan sebutan para calo, demikian juga dengan orang-orang. Kemudian Rasulullah shallallahu 'alaihi wasallam keluar menemui kami pada suatu hari dan memberi kami dengan nama yang lebih baik daripada yang kami dan orang-orang memberi nama untuk diri kami. Setelah itu beliau bersabda: \"Wahai para pedagang, sesungguhnya jual beli kalian ini disaksikan oleh orang yang bersumpah dan pendusta, maka campurlah dengan sedekah.\""
            },
            {
                "number": 3741,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مَنْصُورٌ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّذْرِ وَقَالَ إِنَّهُ لَا يَأْتِي بِخَيْرٍ إِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ الْبَخِيلِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] berkata; telah memberitakan kepada kami [Manshur] dari [Abdullah bin Murrah] dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari nadzar, beliau bersabda: \"Sesungguhnya nadzar tidak membawa kebaikan, hanyasanya ia dikeluarkan dari orang yang bakhil.\""
            },
            {
                "number": 3742,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّذْرِ وَقَالَ إِنَّهُ لَا يَرُدُّ شَيْئًا إِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ الشَّحِيحِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] berkata; telah menceritakan kepada kami [Abu Nu'aim] berkata; telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Abdullah bin Murrah] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari nadzar, beliau bersabda: \"Sesungguhnya nadzar itu tidak mengembalikan sesuatupun, hanyasanya ia dikeluarkan dari orang yang kikir.\""
            },
            {
                "number": 3743,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّذْرُ لَا يُقَدِّمُ شَيْئًا وَلَا يُؤَخِّرُهُ إِنَّمَا هُوَ شَيْءٌ يُسْتَخْرَجُ بِهِ مِنْ الشَّحِيحِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] berkata; telah menceritakan kepada kami [Yahya] berkata; telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Abdullah bin Murrah] dari [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Nadzar tidak dapat mendahulukan sesuatu atau mengakhirkannya, hanyasanya ia dikeluarkan dari orang yang kikir.\""
            },
            {
                "number": 3744,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَأْتِي النَّذْرُ عَلَى ابْنِ آدَمَ شَيْئًا لَمْ أُقَدِّرْهُ عَلَيْهِ وَلَكِنَّهُ شَيْءٌ اسْتُخْرِجَ بِهِ مِنْ الْبَخِيلِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin 'Abdurrahman] berkata; telah menceritakan kepada kami [Sufyan] berkata; telah menceritakan kepada kami [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda (Allah berfirman): \"Nadzar sama sekali tidak bisa mendatangkan sesuatu yang tidak Aku takdirkan bagi anak Adam. dan nadzar hanyalah dikeluarkan dari orang bakhil.\""
            },
            {
                "number": 3745,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْذِرُوا فَإِنَّ النَّذْرَ لَا يُغْنِي مِنْ الْقَدَرِ شَيْئًا وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ الْبَخِيلِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] berkata; telah menceritakan kepada kami [Abdul Aziz] dari [Al 'Ala] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah bernadzar, sesungguhnya nadzar tidak mampu Manahan takdir sedikitpun, akan tetapi hal tersebut adalah sesuatu yang dikeluarkan dari orang yang bakhil.\""
            },
            {
                "number": 3746,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Thalhah bin Abdul Malik] dari [Al Qasim] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bernadzar untuk mentaati Allah maka hendaknya ia mentaati-Nya, dan barangsiapa bernadzar untuk bermaksiat kepada Allah maka janganlah ia bermaksiat kepada-Nya.\""
            },
            {
                "number": 3747,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنِي طَلْحَةُ بْنُ عَبْدِ الْمَلِكِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] berkata; telah menceritakan kepada kami [Yahya] berkata; telah menceritakan kepada kami [Malik] berkata; telah menceritakan kepadaku [Thalhah bin Abdul Malik] dari [Al Qasim] dari [Aisyah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bernadzar untuk mentaati Allah maka hendaknya ia mentaati-Nya, dan barangsiapa bernadzar untuk bermaksiat kepada Allah maka janganlah ia bermaksiat kepada-Nya.\""
            },
            {
                "number": 3748,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] berkata; telah menceritakan kepada kami [Ibnu Idris] dari ['Ubaidullah] dari [Thalhah bin Abdul Malik] dari [Al Qasim] dari [Aisyah] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barangsiapa bernadzar untuk mentaati Allah maka hendaknya ia mentaatinya dan barangsiapa bernadzar untuk bermaksiat kepada Allah maka janganlah ia bermaksiat kepadanya.\""
            },
            {
                "number": 3749,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي جَمْرَةَ عَنْ زَهْدَمٍ قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ يَذْكُرُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُكُمْ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ فَلَا أَدْرِي أَذَكَرَ مَرَّتَيْنِ بَعْدَهُ أَوْ ثَلَاثًا ثُمَّ ذَكَرَ قَوْمًا يَخُونُونَ وَلَا يُؤْتَمَنُونَ وَيَشْهَدُونَ وَلَا يُسْتَشْهَدُونَ وَيُنْذِرُونَ وَلَا يُوفُونَ وَيَظْهَرُ فِيهِمْ السِّمَنُقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا نَصْرُ بْنُ عِمْرَانَ أَبُو جَمْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] berkata; telah menceritakan kepada kami [Khalid] berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Jamrah] dari [Zahdam] berkata; aku mendengar [Imran bin Hushain] menyebutkan, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kalian adalah generasiku, kemudian setelah mereka, kemudian setelah mereka, kemudian setelah mereka.\" Aku tidak mengerti apakah beliau menyebutkan dua kali setelah itu atau tiga kali. Kemudian beliau menyebutkan suatu kaum yang berkhianat dan tidak dapat dipercaya, mereka bersaksi padahal tidak diminta untuk bersaksi, bernadzar dan tidak menepatinya, dan terlihat pada mereka kegemukan.\" Abu 'Abdurrahman berkata, \"Ini adalah Nashr bin Imran Abu Hamzah.\""
            },
            {
                "number": 3750,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي سُلَيْمَانُ الْأَحْوَلُ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ يَقُودُ رَجُلًا فِي قَرَنٍ فَتَنَاوَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَطَعَهُ قَالَ إِنَّهُ نَذْرٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] berkata; telah menceritakan kepada kami [Khalid] dari [Ibnu Juraij] berkata; telah menceritakan kepadaku [Sulaiman Al Ahwal] dari [Thawus] dari [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam melewati seorang laki-laki yang menuntun seorang laki-laki yang lainnya dengan tali, kemudian Nabi shallallahu 'alaihi wasallam mengambil tali tersebut dan memotongnya. Orang tersebut lalu berkata, \"Sesungguhnya itu adalah nadzar.\""
            },
            {
                "number": 3751,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي سُلَيْمَانُ الْأَحْوَلُ أَنَّ طَاوُسًا أَخْبَرَهُ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِرَجُلٍ وَهُوَ يَطُوفُ بِالْكَعْبَةِ يَقُودُهُ إِنْسَانٌ بِخِزَامَةٍ فِي أَنْفِهِ فَقَطَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ ثُمَّ أَمَرَهُ أَنْ يَقُودَهُ بِيَدِهِقَالَ ابْنُ جُرَيْجٍ وَأَخْبَرَنِي سُلَيْمَانُ أَنَّ طَاوُسًا أَخْبَرَهُ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يَطُوفُ بِالْكَعْبَةِ وَإِنْسَانٌ قَدْ رَبَطَ يَدَهُ بِإِنْسَانٍ آخَرَ بِسَيْرٍ أَوْ خَيْطٍ أَوْ بِشَيْءٍ غَيْرِ ذَلِكَ فَقَطَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ ثُمَّ قَالَ قُدْهُ بِيَدِكَ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Sulaiman Al Ahwal] bahwa [Thawus] telah mengabarkan kepadanya, dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam melewati seorang laki-laki yang melakukan thawaf di Ka'bah dituntun oleh seseorang menggunakan tali pada hidungnya, lalu Nabi shallallahu 'alaihi wasallam memotong tali tersebut dengan tangannya, setelah itu beliau memerintahkan kepadanya agar menuntunnya dengan menggunakan tangan.\" [Ibnu Juraij] berkata, \"Dan telah mengabarkan kepadaku [Sulaiman] bahwa [Thawus] telah mengabarkan kepadanya dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam melewatinya saat ia sedang thawaf di Ka'bah, sementara di situ juga terdapat seseorang yang mengikat tangannya dengan orang yang lain menggunakan tali kulit, atau benang, atau sesuatu yang lainnya. Kemudian Nabi shallallahu 'alaihi wasallam memotong tali tersebut menggunakan tangan lalu bersabda: \"Tuntunlah dia menggunakan tanganmu.\""
            },
            {
                "number": 3752,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي أَيُّوبُ قَالَ حَدَّثَنَا أَبُو قِلَابَةَ عَنْ عَمِّهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] berkata; telah menceritakan kepada kami [Sufyan] berkata; telah menceritakan kepadaku [Ayyub] berkata; telah menceritakan kepada kami [Abu Qilabah] dari [pamannya] dari [Imran bin Hushain] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam bermaksiat kepada Allah dan dalam perkara yang tidak dimiliki anak Adam.\""
            },
            {
                "number": 3753,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ ثَابِتِ بْنِ الضَّحَّاكِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ بِمِلَّةٍ سِوَى مِلَّةِ الْإِسْلَامِ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ فِي الدُّنْيَا عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ وَلَيْسَ عَلَى رَجُلٍ نَذْرٌ فِيمَا لَا يَمْلِكُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] berkata; telah menceritakan kepada kami [Abu Al Mughirah] berkata; telah menceritakan kepada kami [Al Auza'i] berkata; telah menceritakan kepadaku [Yahya] dari [Abu Qilabah] dari [Tsabit bin Adl Dlahhak] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan agama selain Islam secara dusta, maka berlaku seperti apa yang ia katakan, dan barangsiapa membunuh dirinya dengan sesuatu di dunia maka akan diadzab dengannya pada Hari Kiamat, dan tidak ada nadzar atas seseorang dalam perkara yang tidak ia miliki.\""
            },
            {
                "number": 3754,
                "arab": "أَخْبَرَنِي يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَخْبَرَهُ أَنَّ أَبَا الْخَيْرِ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَنَذَرَتْ أُخْتِي أَنْ تَمْشِيَ إِلَى بَيْتِ اللَّهِ فَأَمَرَتْنِي أَنْ أَسْتَفْتِيَ لَهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَفْتَيْتُ لَهَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِتَمْشِ وَلْتَرْكَبْ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] berkata; telah menceritakan kepadaku [Sa'id bin Abu Ayyub] dari [Yazid bin Abu Habib] ia telah mengabarkan kepadanya, bahwa [Abu Al Khair] menceritakan kepadanya dari ['Uqbah bin 'Amir] ia berkata, \"Saudara perempuanku bernadzar untuk berjalan menuju Ka'bah dan memerintahkan aku agar memintakan fatwa kepada Rasulullah shallallahu 'alaihi wasallam, kemudian aku memintakan fatwa kepada Nabi shallallahu 'alaihi wasallam, beliau pun bersabda: \"Hendaknya ia berjalan dan berkendaraan.\""
            },
            {
                "number": 3755,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ وَقَالَ عَمْرٌو إِنَّ عُبَيْدَ اللَّهِ بْنَ زَحْرٍ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ أَنَّ عُقْبَةَ بْنَ عَامِرٍ أَخْبَرَهُأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أُخْتٍ لَهُ نَذَرَتْ أَنْ تَمْشِيَ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْهَا فَلْتَخْتَمِرْ وَلْتَرْكَبْ وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] dan [Muhammad bin Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yahya bin Sa'id] dari ['Ubaidullah bin Zahr], dan ['Amru] berkata; bahwa ['Ubaidullah bin Zahr] telah mengabarkan kepadanya dari [Abdullah bin Malik] bahwa ['Uqbah bin 'Amir] telah mengabarkan kepadanya, bahwa ia bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai saudara perempuannya yang bernadzar untuk berjalan kaki tanpa menggunakan khimar (kerudung). Nabi shallallahu 'alaihi wasallam lalu bersabda kepadanya: \"Perintahkan kepadanya agar ia menggunakan khimar, naik kendaraan dan berpuasa tiga hari.\""
            },
            {
                "number": 3756,
                "arab": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ الْعَسْكَرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ قَالَ سَمِعْتُ سُلَيْمَانَ يُحَدِّثُ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَرَكِبَتْ امْرَأَةٌ الْبَحْرَ فَنَذَرَتْ أَنْ تَصُومَ شَهْرًا فَمَاتَتْ قَبْلَ أَنْ تَصُومَ فَأَتَتْ أُخْتُهَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرَتْ ذَلِكَ لَهُ فَأَمَرَهَا أَنْ تَصُومَ عَنْهَا",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Khalid Al 'Askari] berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] berkata; aku mendengar [Sulaiman] menceritakan dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Seorang wanita mengarungi lautan dan bernadzar untuk berpuasa satu bulan, kemudian ia meninggal sebelum berpuasa. Lalu suadara perempuannya datang kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepadanya. Kemudian beliau memerintahkan kepadanya agar berpuasa untuk saudara perempuannya.\""
            },
            {
                "number": 3757,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍأَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ تُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ اقْضِهِ عَنْهَا",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dan [Al Harits bin Miskin] dengan membacakan riwayat dan aku mendengar, lafazhnya adalah lafazh Al Harits, dari [Sufyan] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas], bahwa Sa'd bin Ubadah meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam mengenai nadzar yang menjadi kewajiban atas ibunya yang telah meninggal sebelum menunaikannya. Maka beliau bersabda: \"Tunaikanlahj nadzar tersebut untuknya.\""
            },
            {
                "number": 3758,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَاسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] berkata, \"Sa'd bin 'Ubadah meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam mengenai nadzar yang menjadi kewajiban atas ibunya yang telah meninggal sebelum menunaikannya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tunaikanlah nadzar tersebut untuknya.\""
            },
            {
                "number": 3759,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ وَهَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ عَنْ عَبْدَةَ عَنْ هِشَامٍ وَهُوَ ابْنُ عُرْوَةَ عَنْ بَكْرِ بْنِ وَائِلٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَجَاءَ سَعْدُ بْنُ عُبَادَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ فَلَمْ تَقْضِهِ قَالَ اقْضِهِ عَنْهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam] dan [Harun bin Ishaq Al Hamdani] dari ['Abdah] dari [Hisyam] -yaitu Ibnu 'Urwah- dari [Bakr bin Wail] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] berkata, \"Sa'd bin 'Ubadah datang kepada Nabi shallallahu 'alaihi wasallam kemudian berkata, \"Sesungguhnya ibuku telah meninggal dan ia memiliki kewajiban nadzar yang belum sempat ia kerjakan. Maka beliau bersabda mengenai nadzar yang menjadi kewajiban ibunya dan belum sempat dikerjakan hingga meninggal, beliau katakan: \"Tunaikanlah nadzar tersebut untuknya.\""
            },
            {
                "number": 3760,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مُوسَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَأَنَّهُ كَانَ عَلَيْهِ لَيْلَةٌ نَذَرَ فِي الْجَاهِلِيَّةِ يَعْتَكِفُهَا فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ أَنْ يَعْتَكِفَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Musa] berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari [Umar], bahwa ia memiliki kewajiban nadzar untuk beri'tikaf satu malam pada masa jahiliyah, ketika ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau pun memerintahkan kepadanya untuk beri'tikaf.\""
            },
            {
                "number": 3761,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ عَلَى عُمَرَ نَذْرٌ فِي اعْتِكَافِ لَيْلَةٍ فِي الْمَسْجِدِ الْحَرَامِ فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَمَرَهُ أَنْ يَعْتَكِفَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid] berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] berkata, \"Pernah Umar memiliki kewajiban nadzar untuk beri'tikaf satu malam di Masjid Al Haram, kemudian ia menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau memerintahkan kepadanya agar beri'tikaf.\""
            },
            {
                "number": 3762,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ عُمَرَ كَانَ جَعَلَ عَلَيْهِ يَوْمًا يَعْتَكِفُهُ فِي الْجَاهِلِيَّةِ فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَمَرَهُ أَنْ يَعْتَكِفَهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakam] berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] berkata; aku mendengar ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar], bahwa Umar pernah mewajibkan atas dirinya satu hari untuk beri'tikaf pada masa jahiliyah, kemudian ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hal tersebut. Maka beliau memerintahkan kepadanya agar beri'tikaf.\""
            },
            {
                "number": 3763,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تِيبَ عَلَيْهِ يَا رَسُولَ اللَّهِ إِنِّي أَنْخَلِعُ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَرَسُولِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَقَالَ أَبُو عَبْد الرَّحْمَنِ يُشْبِهُ أَنْ يَكُونَ الزُّهْرِيُّ سَمِعَ هَذَا الْحَدِيثَ مِنْ عَبْدِ اللَّهِ بْنِ كَعْبٍ وَمِنْ عَبْدِ الرَّحْمَنِ عَنْهُ فِي هَذَا الْحَدِيثِ الطَّوِيلِ تَوْبَةُ كَعْبٍ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] berkata; telah mengabarkan kepadaku [Abdullah bin Ka'b] dari [ayahnya], bahwa ia berkata kepada Rasulullah shallallahu 'alaihi wasallam ketika ia mendapatkan taubat, \"Wahai Rasulullah, sesungguhnya aku memberikan hartaku sebagai sedekah kepada Allah dan Rasul-Nya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Tahanlah sebagian hartamu, hal itu lebih baik bagimu.\" Abu 'Abdurrahman berkata, \"Sepertinya Az Zuhri mendengar hadits ini dari Abdullah bin Ka'b dan dari 'Abdurrahman, dalam hadits yang panjang ini terdapat taubat Ka'b.\""
            },
            {
                "number": 3764,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ قَالَ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبِ بْنِ مَالِكٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍيُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ قَالَ فَلَمَّا جَلَسْتُ بَيْنَ يَدَيْهِ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ فَقُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ مُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud] berkata; telah memberitakan kepada kami [Ibnu Wahb] dari [Yunus] berkata; [Ibnu Syihab] berkata; telah mengabarkan kepadaku ['Abdurrahman bin Ka'b bin Malik] bahwa [Abdullah bin Ka'b] berkata; aku mendengar [Ka'b bin Malik] menceritakan peristiwanya ketika tertinggal dari Rasulullah shallallahu 'alaihi wasallam dalam perang Tabuk. Ia berkata, \"Tatkala aku duduk di hadapannya, aku katakan, \"Wahai Rasulullah, sesungguhnya taubatku adalah melepaskan diri dari hartaku sebagai sedekah kepada Allah dan Rasul-Nya.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Tahanlah sebagian hartamu, hal tersebut lebih baik bagimu.\" Kemudian aku katakan, \"Sesungguhnya aku menahan sahamku yang ada di Khaibar.\""
            },
            {
                "number": 3765,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ قَالَ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍيُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ عَلَيْكَ مَالَكَ فَهُوَ خَيْرٌ لَكَ قُلْتُ فَإِنِّي أُمْسِكُ عَلَيَّ سَهْمِي الَّذِي بِخَيْبَرَ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad] berkata; telah menceritakan kepada kami [Laits bin Sa'd] berkata; telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] berkata; telah menceritakan kepadaku ['Abdurrahman bin Abdullah bin Ka'b] bahwa [Abdullah bin Ka'b bin Malik] berkata, \"Aku mendengar [Ka'b bin Malik] menceritakan peristiwanya ketika tertinggal dari Rasulullah shallallahu 'alaihi wasallam dalam perang Tabuk. Aku berkata, \"Aku katakan, \"Wahai Rasulullah, sesungguhnya taubatku adalah melepaskan diri dari hartaku sebagai sedekah kepada Allah dan Rasul-Nya.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Tahanlah sebagian hartamu, hal tersebut lebih baik bagimu.\" Kemudian aku katakan, \"Sesungguhnya aku menahan sahamku yang ada di Khaibar.\""
            },
            {
                "number": 3766,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ قَالَ حَدَّثَنَا مَعْقِلٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ عَنْ عَمِّهِ عُبَيْدِ اللَّهِ بْنِ كَعْبٍ قَالَ سَمِعْتُ أَبِي كَعْبَ بْنَ مَالِكٍ يُحَدِّثُ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِنَّمَا نَجَّانِي بِالصِّدْقِ وَإِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَقَالَ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ قُلْتُ فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'dan bin Isa] berkata; telah menceritakan kepada kami [Al Hasan bin A'yan] berkata; telah menceritakan kepada kami [Ma'qil] dari [Az Zuhri] berkata; telah mengabarkan kepadaku ['Abdurrahman bin Abdullah bin Ka'b] dari pamannya ['Ubaidullah bin Ka'b] berkata, Saya telah mendengar [bapakku, Ka'b bin Malik] menceritakan, dia berkata; \"Sesungguhnya Allah 'azza wajalla menyelamatkan aku karena bersedekah, dan di antara taubatku adalah melepaskan diri dari hartaku sebagai sedekah kepada Allah dan Rasul-Nya. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tahanlah sebagian hartamu, hal tersebut lebih baik bagimu.\" Kemudian aku katakan, \"Sesungguhnya aku menahan sahamku yang ada di Khaibar.\""
            },
            {
                "number": 3767,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ثَوْرِ بْنِ زَيْدٍ عَنْ أَبِي الْغَيْثِ مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ خَيْبَرَ فَلَمْ نَغْنَمْ إِلَّا الْأَمْوَالَ وَالْمَتَاعَ وَالثِّيَابَ فَأَهْدَى رَجُلٌ مِنْ بَنِي الضُّبَيْبِ يُقَالُ لَهُ رِفَاعَةُ بْنُ زَيْدٍ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُلَامًا أَسْوَدَ يُقَالُ لَهُ مِدْعَمٌ فَوُجِّهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى وَادِي الْقُرَى حَتَّى إِذَا كُنَّا بِوَادِي الْقُرَى بَيْنَا مِدْعَمٌ يَحُطُّ رَحْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَهُ سَهْمٌ فَأَصَابَهُ فَقَتَلَهُ فَقَالَ النَّاسُ هَنِيئًا لَكَ الْجَنَّةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّا وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَهَا يَوْمَ خَيْبَرَ مِنْ الْمَغَانِمِ لَتَشْتَعِلُ عَلَيْهِ نَارًا فَلَمَّا سَمِعَ النَّاسُ بِذَلِكَ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ بِشِرَاكَيْنِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِرَاكٌ أَوْ شِرَاكَانِ مِنْ نَارٍ",
                "id": "Telah mengabarkan kepada kami [Al Harits bin Miskin] dengan membaca riwayat dan aku mendengar, dari [Ibnu Al Qasim] berkata; telah menceritakan kepadaku [Malik] dari [Tsaur bin Zaid] dari [Abu Al Ghaits] mantan budak Ibnu Muthi', dari [Abu Hurairah] ia berkata, \"Kami bersama Rasulullah shallallahu 'alaihi wasallam ketika perang Khaibar, dan kami tidak mendapatkan harta rampasan kecuali harta benda, barang-barang, dan pakaian. Kemudian seorang laki-laki dari Bani Adl Dlubaib yang dipanggil Rifa'ah bin Zaid memberikan hadiah kepada Rasulullah shallallahu 'alaihi wasallam berupa budak berkulit hitam yang dipanggil Mid'am. Rasulullah shallallahu 'alaihi wasallam lalu menuju ke lembah Al Qura hingga ketika kami sampai di lembah Al Qura, tatkala Mid'am menurunkan kendaraan Rasulullah shallallahu 'alaihi wasallam, tiba-tiba meluncurlah panah hingga mengenai dan membunuhnya, orang-orang pun berkata, \"Selamat, bagimu Surga.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Sekali-kali tidak! Demi jiwaku yang berada ditangan-Nya, sesungguhnya pakaian yang ia ambil ketika perang Khaibar akan menyala dengan api.\" Ketika orang-orang mendengar hal itu, seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa satu atau dua pasang sandal, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu atau dua sandal dari neraka.\""
            },
            {
                "number": 3768,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ كَثِيرَ بْنَ فَرْقَدٍ حَدَّثَهُ أَنَّ نَافِعًا حَدَّثَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدْ اسْتَثْنَى",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata; telah mengabarkan kepadaku ['Amru bin Al Harits] bahwa [Katsir bin Farqad] menceritakan kepadanya, bahwa [Nafi'] menceritakan kepada mereka dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dan mengatakan, 'Insyaallah', maka ia telah mengucapkan pengecualian.\""
            },
            {
                "number": 3769,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدْ اسْتَثْنَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dan mengatakan, 'Insyaallah', maka ia telah mengucapkan pengecualian.\""
            },
            {
                "number": 3770,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ إِنْ شَاءَ اللَّهُ فَهُوَ بِالْخِيَارِ إِنْ شَاءَ أَمْضَى وَإِنْ شَاءَ تَرَكَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] berkata; telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Wuhaib] berkata; telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa bersumpah dengan suatu sumpah dan berkata, 'insya Allah', maka ia memiliki pilihan; jika mau ia boleh meneruskannya, dan jika mau ia boleh meninggalkannya.\""
            },
            {
                "number": 3771,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ أَنْبَأَنَا شُعَيْبٌ قَالَ حَدَّثَنِي أَبُو الزِّنَادِ مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الْأَعْرَجُ مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ بِهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ لَأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً كُلُّهُنَّ يَأْتِي بِفَارِسٍ يُجَاهِدُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ لَهُ صَاحِبُهُ إِنْ شَاءَ اللَّهُ فَلَمْ يَقُلْ إِنْ شَاءَ اللَّهُ فَطَافَ عَلَيْهِنَّ جَمِيعًا فَلَمْ تَحْمِلْ مِنْهُنَّ إِلَّا امْرَأَةٌ وَاحِدَةٌ جَاءَتْ بِشِقِّ رَجُلٍ وَأَيْمُ الَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ إِنْ شَاءَ اللَّهُ لَجَاهَدُوا فِي سَبِيلِ اللَّهِ فُرْسَانًا أَجْمَعِينَ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Bakkar] berkata; telah menceritakan kepada kami [Ali bin 'Ayyasy] berkata; telah memberitakan kepada kami [Syu'aib] berkata; telah menceritakan kepadaku [Abu Az Zinad] di antara apa yang diceritakan kepada ['Abdurrahman Al A'raj] di antara yang ia sebutkan adalah, bahwa ia mendengar [Abu Hurairah] menceritakan dengannya, dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sulaiman bin Daud berkata, 'Sungguh, aku akan akan menggilir sembilan puluh isteri pada malam ini. Setiap mereka akan melahirkan seorang penunggang kuda yang akan berjihad di jalan Allah 'azza wajalla', salah seorang sahabatnya lalu berkata kepadanya, 'Insyaallah.' Namun Sulaiman tidak mengucapkan insya Allah. Setelah itu ia menggilir mereka semua, dan tidak ada seorang pun dari mereka yang hamil kecuali seorang wanita yang melahirkan anak setengah laki-laki. Demi Dzat yang jiwa Muhammad ada di tangan-Nya, seandainya ia mengucapkan 'insyaallah', niscaya mereka akan berjihad di jalan Allah sebagai penunggang kuda semuanya.\""
            },
            {
                "number": 3772,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى بْنِ الْوَزِيرِ بْنِ سُلَيْمَانَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ كَعْبِ بْنِ عَلْقَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Yahya bin Al Wazir bin Sulaiman] dan [Al Harits bin Miskin] dengan membacakan riwayat, dan aku mendengar dari [Ibnu Wahb] berkata; telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Ka'b bin 'Alqamah] dari ['Abdurrahman bin Syimasah] dari ['Alqamah bin 'Amir], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kafarah nadzar adalah kafarah sumpah.\""
            },
            {
                "number": 3773,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ أَنَّهُ بَلَغَهُ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid] berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] bahwa telah sampai kepadanya dari [Al Qasim] dari [Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan.\""
            },
            {
                "number": 3774,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ",
                "id": "Telah mengabarkan kepada kami Yunus bin Abdul A'la berkata: telah menceritakan kepada kami Ibnu Wahb berkata: telah mengabarkan kepadaku Yunus dari Ibnu Syihab dari Abu Salamah dari Aisyah, bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3775,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرِّمِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak Al Mukharrimi] berkata; telah menceritakan kepada kami [Yahya bin Adam] berkata; telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Yunus] dari [Az Zuhri] dari [Abu Salamah] dari [Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3776,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] berkata; telah memberitakan kepada kami [Utsman bin Umar] berkata; telah menceritakan kepada kami [Yunus] dari [Az Zuhri] dari [Abu Salamah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3777,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو صَفْوَانَ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ قَالَ أَبُو عَبْد الرَّحْمَنِ وَقَدْ قِيلَ أَنَّ الزُّهْرِيَّ لَمْ يَسْمَعْ هَذَا مِنْ أَبِي سَلَمَةَ",
                "id": "Telah mengabarkan kepada kami Qutaibah berkata: telah menceritakan kepada kami Abu Shafwan dari Yunus dari Az Zuhri dari Abu Salamah dari Aisyah berkata: \"Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\" Abu 'Abdurrahman berkata: \"Dikatakan bahwa Az Zuhri tidak mendengar hadits ini dari Abu Salamah.\""
            },
            {
                "number": 3778,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ مُوسَى الْفَرَوِيُّ قَالَ حَدَّثَنَا أَبُو ضَمْرَةَ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ الْيَمِينِ",
                "id": "Telah mengabarkan kepada kami [Harun bin Musa Al Farawi] berkata; telah menceritakan kepada kami [Abu Dlamrah] dari [Yunus] dari [Ibnu Syihab] berkata; telah menceritakan kepada kami [Abu Salamah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3779,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ التِّرْمِذِيُّ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ وَمُوسَى بْنِ عُقْبَةَ عَنْ ابْنِ شِهَابٍ عَنْ سُلَيْمَانَ بْنِ أَرْقَمَ أَنَّ يَحْيَى بْنَ أَبِي كَثِيرٍ الَّذِي كَانَ يَسْكُنُ الْيَمَامَةَ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا سَلَمَةَ يُخْبِرُ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ يَمِينٍقَالَ أَبُو عَبْد الرَّحْمَنِ سُلَيْمَانُ بْنُ أَرْقَمَ مَتْرُوكُ الْحَدِيثِ وَاللَّهُ أَعْلَمُ خَالَفَهُ غَيْرُ وَاحِدٍ مِنْ أَصْحَابِ يَحْيَى بْنِ أَبِي كَثِيرٍ فِي هَذَا الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il At Tirmidzi] berkata; telah menceritakan kepada kami [Ayyub bin Sulaiman] berkata; telah menceritakan kepadaku [Abu Bakr bin Abu Uwais] berkata; telah menceritakan kepadaku [Sulaiman bin Bilal] dari [Muhammad bin Abu 'Atiq], dan [Musa bin 'Uqbah] dari [Ibnu Syihab] dari [Sulaiman bin Arqam] bahwa [Yahya bin Abu Katsir] yang tinggal di Yamamah telah menceritakan kepadanya, bahwa ia mendengar [Abu Salamah] mengabarkan dari [Aisyah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\" Abu 'Abdurrahman berkata, \"Sulaiman bin Arqam adalah orang yang ditinggalkan haditsnya. Wallahu A'lam. Dalam hadits ini, tidak hanya satu orang saja yang menyelisihinya di antara sahabat Yahya bin Katsir.\""
            },
            {
                "number": 3780,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ ابْنِ الْمُبَارَكِ وَهُوَ عَلِيٌّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ عَنْ أَبِيهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Waki'] dari [Ibnu Al Mubarak] -yaitu Ali- dari [Yahya bin Abu Katsir] dari [Muhammad bin Az Zubair Al Hanzhali] dari [ayahnya] dari [Imran bin Hushain] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3781,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ أَبِي عَمْرٍو وَهُوَ الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ عَنْ أَبِيهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهَا كَفَّارَةُ يَمِينٍ",
                "id": "Telah mengabarkan kepada kami 'Amru bin Utsman berkata: telah menceritakan kepada kami Baqiyyah dari Abu 'Amru -yaitu Al Auza'i- dari Yahya bin Abu Katsir dari Muhammad bin Az Zubair Al Hanzhali dari ayahnya dari Imran bin Hushain radliallahu 'anhuma, ia berkata: \"Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3782,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ قَالَ حَدَّثَنَا مَعْمَرُ بْنُ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ بِشْرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدٍ الْحَنْظَلِيِّ عَنْ أَبِيهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِقَالَ أَبُو عَبْد الرَّحْمَنِ مُحَمَّدُ بْنُ الزُّبَيْرِ ضَعِيفٌ لَا يَقُومُ بِمِثْلِهِ حُجَّةٌ وَقَدْ اخْتُلِفَ عَلَيْهِ فِي هَذَا الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Maimun] berkata; telah menceritakan kepada kami [Ma'mar bin Sulaiman] dari [Abdullah bin Bisyr] dari [Yahya bin Abu Katsir] dari [Muhammad Al Hanzhali] dari [ayahnya] dari [Imran bin Hushain] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemarahan, dan kafarahnya adalah kafarah sumpah.\" Abu 'Abdurrahman berkata, \"Muhammad bin Az Zubair adalah seorang yang lemah, haditsnya tidak bisa menjadi hujjah atas hadits lain yang semisal (kelemahannya), dan dalam hadits ini ia banyak diperselisihkan.\""
            },
            {
                "number": 3783,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ عِمْرَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub] berkata; telah menceritakan kepada kami [Al Hasan bin Musa] berkata; telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Muhammad bin Az Zubair] dari [ayahnya] dari [Imran] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar dalam kemarahan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3784,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ أَنْبَأَنَا حَمَّادٌ عَنْ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عِمْرَانَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ وَقِيلَ إِنَّ الزُّبَيْرَ لَمْ يَسْمَعْ هَذَا الْحَدِيثَ مِنْ عِمْرَانَ بْنِ حُصَيْنٍ",
                "id": "Telah mengabarkan kepada kami Qutaibah telah memberitakan kepada kami Hammad dari Muhammad dari ayahnya dari Imran berkata: \"Nabi shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemarahan, dan kafarahnya adalah kafarah sumpah.\" Dan dikatakan, \"Sesungguhnya Az Zubair tidak mendengar hadits ini dari Imran bin Hushain.\""
            },
            {
                "number": 3785,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي ابْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ أَهْلِ الْبَصْرَةِ قَالَ صَحِبْتُ عِمْرَانَ بْنَ حُصَيْنٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ النَّذْرُ نَذْرَانِ فَمَا كَانَ مِنْ نَذْرٍ فِي طَاعَةِ اللَّهِ فَذَلِكَ لِلَّهِ وَفِيهِ الْوَفَاءُ وَمَا كَانَ مِنْ نَذْرٍ فِي مَعْصِيَةِ اللَّهِ فَذَلِكَ لِلشَّيْطَانِ وَلَا وَفَاءَ فِيهِ وَيُكَفِّرُهُ مَا يُكَفِّرُ الْيَمِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Wahb] berkata; telah menceritakan kepada kami [Muhammad bin Salamah] berkata; telah menceritakan kepadaku [Ibnu Ishaq] dari [Muhammad bin Az Zubair] dari [ayahnya] dari [seorang laki-laki] penduduk Bashrah, ia berkata; aku menemani [Imran bin Hushain] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Nadzar ada dua; nadzar dalam ketaatan kepada Allah, maka hal tersebut adalah untuk Allah dan harus ditunaikan, sedangkan nadzar dalam bermaksiat kepada Allah, maka hal tersebut adalah untuk setan dan tidak boleh ditunaikan, dan ia bisa dihapus oleh kafarah yang menghapus sumpah.\""
            },
            {
                "number": 3786,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ الْحَنْظَلِيِّ قَالَ أَخْبَرَنِي أَبِي أَنَّ رَجُلًا حَدَّثَهُ أَنَّهُ سَأَلَ عِمْرَانَ بْنَ حُصَيْنٍ عَنْ رَجُلٍ نَذَرَ نَذْرًا لَا يَشْهَدُ الصَّلَاةَ فِي مَسْجِدِ قَوْمِهِ فَقَالَ عِمْرَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نَذْرَ فِي غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ",
                "id": "Telah mengabarkan kepada kami Ibrahim bin Ya'qub berkata: telah menceritakan kepada kami Musaddad berkata: telah menceritakan kepada kami Abdul Warits dari Muhammad bin Az Zubair Al Hanzhali berkata: telah mengabarkan kepadaku ayahku bahwa seorang laki-laki menceritakan kepadanya, bahwa ia bertanya kepada Imran bin Hushain mengenai seorang laki-laki yang bernadzar untuk tidak menghadiri shalat di masjid kaumnya. Maka Imran berkata: \"Aku mendengar Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemurkaan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3787,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَلَا غَضَبٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ",
                "id": "Telah mengabarkan kepada kami Ahmad bin Harb berkata: telah menceritakan kepada kami Abu Daud berkata: telah menceritakan kepada kami Sufyan dari Muhammad bin Az Zubair dari Al Hasan dari Imran bin Hushain berkata: \"Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan dan kemarahan, dan kafarahnya adalah kafarah sumpah.\""
            },
            {
                "number": 3788,
                "arab": "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو سُلَيْمٍ وَهُوَ عُبَيْدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو بَكْرٍ النَّهْشَلِيُّ عَنْ مُحَمَّدِ بْنِ الزُّبَيْرِ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي الْمَعْصِيَةِ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ خَالَفَهُ مَنْصُورُ بْنُ زَاذَانَ فِي لَفْظِهِ",
                "id": "Telah mengabarkan kepada kami Hilal bin Al 'Ala berkata: telah menceritakan kepada kami Abu Sulaim -yaitu 'Ubaid bin Yahya- berkata: telah menceritakan kepada kami Abu Bakr An Nahsyali dari Muhammad bin Az Zubair dari Al Hasan dari Imran bin Hushain ia berkata: \"Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan, dan kafarahnya adalah kafarah sumpah.\" Dan Manshur bin Zadzan menyelisihi hadits tersebut dalam lafazhnya."
            },
            {
                "number": 3789,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا مَنْصُورٌ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ لِابْنِ آدَمَ فِيمَا لَا يَمْلِكُ وَلَا فِي مَعْصِيَةِ اللَّهِ عَزَّ وَجَلَّ خَالَفَهُ عَلِيُّ بْنُ زَيْدٍ فَرَوَاهُ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ",
                "id": "Telah mengabarkan kepada kami Ya'qub bin Ibrahim berkata: telah memberitakan kepada kami Husyaim berkata: telah memberitakan kepada kami Manshur dari Al Hasan dari Imran bin Hushain berkata: \"Nabi shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar bagi anak Adam dalam perkara yang tidak ia dimiliki atau dalam bermaksiat kepada Allah 'azza wajalla.\" Hadits tersebut diselisihi oleh Ali bin Zaid, ia meriwayatkannya dari Al Hasan, dari 'Abdurrahman bin Samurah."
            },
            {
                "number": 3790,
                "arab": "أَخْبَرَنِي عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا خَلَفُ بْنُ تَمِيمٍ قَالَ حَدَّثَنَا زَائِدَةُ قَالَ حَدَّثَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جَدْعَانَ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةٍ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ قَالَ أَبُو عَبْد الرَّحْمَنِ عَلِيُّ بْنُ زَيْدٍ ضَعِيفٌ وَهَذَا الْحَدِيثُ خَطَأٌ وَالصَّوَابُ عِمْرَانُ بْنُ حُصَيْنٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ مِنْ وَجْهٍ آخَرَ",
                "id": "Telah mengabarkan kepada kami Ali bin Muhammad bin Ali berkata: telah menceritakan kepada kami Khalaf bin Tamim berkata: telah menceritakan kepada kami Za`idah berkata: telah menceritakan kepada kami Ali bin Zaid bin Jad'an dari Al Hasan dari 'Abdurrahman bin Samurah dari Nabi shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan atau dalam perkara yang tidak dimiliki oleh anak Adam.\" Abu Abdurrahman berkata: \"Ali bin Zaid adalah seorang yang lemah dan hadits ini salah, yang benar adalah Imran bin Hushain. Dan hadits ini juga telah diriwayatkan dari Imran bin Hushain dari jalur yang lain.\""
            },
            {
                "number": 3791,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي أَيُّوبُ قَالَ حَدَّثَنَا أَبُو قِلَابَةَ عَنْ عَمِّهِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Manshur berkata: telah menceritakan kepada kami Sufyan berkata: telah menceritakan kepadaku Ayyub berkata: telah menceritakan kepada kami Abu Qilabah dari pamannya dari Imran bin Hushain berkata: \"Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Tidak boleh ada nadzar dalam kemaksiatan atau dalam perkara yang tidak dimiliki oleh anak Adam.\""
            },
            {
                "number": 3792,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ حُمَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَرَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُهَادَى بَيْنَ رَجُلَيْنِ فَقَالَ مَا هَذَا قَالُوا نَذَرَ أَنْ يَمْشِيَ إِلَى بَيْتِ اللَّهِ قَالَ إِنَّ اللَّهَ غَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ مُرْهُ فَلْيَرْكَبْ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] berkata; telah memberitakan kepada kami [Hammad bin Mas'adah] dari [Humaid] dari [Tsabit] dari [Anas] berkata, \"Nabi shallallahu 'alaihi wasallam melihat seorang laki-laki yang berjalan dengan diapit antara dua orang, kemudian beliau bertanya: \"Apa ini?\" mereka menjawab, \"Ia nadzar untuk berjalan menuju Ka'bah.\" Beliau bersabda: \"Sungguh, Allah tidak butuh kepada penyiksaan orang ini terhadap dirinya, perintahkan dia agar naik kendaraan.\""
            },
            {
                "number": 3793,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْخٍ يُهَادَى بَيْنَ اثْنَيْنِ فَقَالَ مَا بَالُ هَذَا قَالُوا نَذَرَ أَنْ يَمْشِيَ قَالَ إِنَّ اللَّهَ غَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ مُرْهُ فَلْيَرْكَبْ فَأَمَرَهُ أَنْ يَرْكَبَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] berkata; telah menceritakan kepada kami [Khalid] berkata; telah menceritakan kepada kami [Humaid] dari [Tsabit] dari [Anas] berkata, \"Rasulullah shallallahu 'alaihi wasallam melewati orang yang sudah tua berjalan di antara dua orang dengan cara diapit, kemudian beliau bersabda: \"Apa ini?\" Mereka menjawab, \"Ia bernadzar untuk berjalan menuju Ka'bah.\" Beliau pun bersabda: \"Sesungguhnya Allah tidak butuh kepada penyiksaan orang ini terhadap dirinya, perintahkan dia agar naik kendaraan.\" Beliau memerintahkan kepadanya agar naik kendaraan.\""
            },
            {
                "number": 3794,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَجُلٍ يُهَادَى بَيْنَ ابْنَيْهِ فَقَالَ مَا شَأْنُ هَذَا فَقِيلَ نَذَرَ أَنْ يَمْشِيَ إِلَى الْكَعْبَةِ فَقَالَ إِنَّ اللَّهَ لَا يَصْنَعُ بِتَعْذِيبِ هَذَا نَفْسَهُ شَيْئًا فَأَمَرَهُ أَنْ يَرْكَبَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Hafsh] berkata; telah menceritakan kepadaku [ayahku] berkata; telah menceritakan kepadaku [Ibrahim bin Thahman] dari [Yahya bin Sa'id] dari [Humaid Ath Thawil] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam datang kepada seorang laki-laki yang berjalan di antara dua orang anaknya dengan cara diapit, kemudian beliau bertanya: \"Ada apa orang ini?\" Maka dikatakan, \"Ia bernadzar untuk berjalan menuju Ka'bah.\" Kemudian beliau bersabda: \"Sesungguhnya Allah tidak berbuat sesuatupun dengan penyiksaan yang dilakukan orang ini terhadap dirinya.\" Kemudian beliau memerintahkan kepadanya agar naik kendaraan.\""
            },
            {
                "number": 3795,
                "arab": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ إِنْ شَاءَ اللَّهُ فَقَدْ اسْتَثْنَى",
                "id": "Telah mengabarkan kepada kami [Nuh bin Habib] berkata; telah memberitakan kepada kami [Abdurrazaq] berkata; telah memberitakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan suatu sumpah kemudian berkata, 'Insyaallah', maka ia telah mengucapkan pengecualian.\""
            },
            {
                "number": 3796,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ رَفَعَهُقَالَ سُلَيْمَانُ لَأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً تَلِدُ كُلُّ امْرَأَةٍ مِنْهُنَّ غُلَامًا يُقَاتِلُ فِي سَبِيلِ اللَّهِ فَقِيلَ لَهُ قُلْ إِنْ شَاءَ اللَّهُ فَلَمْ يَقُلْ فَطَافَ بِهِنَّ فَلَمْ تَلِدْ مِنْهُنَّ إِلَّا امْرَأَةٌ وَاحِدَةٌ نِصْفَ إِنْسَانٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ قَالَ إِنْ شَاءَ اللَّهُ لَمْ يَحْنَثْ وَكَانَ دَرَكًا لِحَاجَتِهِ",
                "id": "Telah mengabarkan kepada kami [Al Abbas bin Abdul 'Azhim] berkata; telah menceritakan kepada kami [Abdurrazaq] berkata; telah memberitakan kepada kami [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Abu Hurairah] dan ia memarfu'kannya, \"Sulaiman berkata, \"Sungguh, aku akan menggilir sembilan puluh isteri pada malam ini, setiap orang dari mereka akan melahirkan anak yang akan berperang di jalan Allah.\" Kemudian dikatakan kepadanya, 'Ucapkanlah 'Insyaallah'.' Namun Sulaiman tidak mengucapkannya, kemudian ia menggilir mereka dan tidak ada di antara mereka yang melahirkan kecuali seorang wanita yang melahirkan setengah manusia.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Seandainya Sulaiman mengucapkan, 'Insyaallah', maka ia tidak berdosa dan hal itu akan mewujudkan keperluannya.\""
            },
            {
                "number": 3797,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ أَبِي سَعِيدٍ قَالَإِذَا اسْتَأْجَرْتَ أَجِيرًا فَأَعْلِمْهُ أَجْرَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] berkata; telah memberitakan kepada kami [Hibban] berkata; telah memberitakan kepada kami [Abdullah] dari [Syu'bah] dari [Hammad] dari [Ibrahim] dari [Abu Sa'id] berkata, \"Jika kamu memperkerjakan orang, maka beritahukanlah upahnya.\""
            },
            {
                "number": 3798,
                "arab": "أَخْبَرَنَا مُحَمَّدٌ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ يُونُسَ عَنْ الْحَسَنِأَنَّهُ كَرِهَ أَنْ يَسْتَأْجِرَ الرَّجُلَ حَتَّى يُعْلِمَهُ أَجْرَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad] berkata; telah memberitakan kepada kami [Hibban] berkata; telah memberitakan kepada kami [Abdullah] dari [Hammad bin Salamah] dari [Yunus] dari [Al Hasan], bahwa ia membenci untuk menyewa orang hingga ia memberitahukan kepadanya jumlah upahnya.\""
            },
            {
                "number": 3799,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ جَرِيرِ بْنِ حَازِمٍ عَنْ حَمَّادٍ هُوَ ابْنُ أَبِي سُلَيْمَانَأَنَّهُ سُئِلَ عَنْ رَجُلٍ اسْتَأْجَرَ أَجِيرًا عَلَى طَعَامِهِ قَالَ لَا حَتَّى تُعْلِمَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] berkata; telah memberitakan kepada kami [Hibban] berkata; telah memberitakan kepada kami [Abdullah] dari [Jarir bin Hazim] dari [Hammad] -yaitu Ibnu Abu Sulaiman-, bahwa ia pernah ditanya mengenai seseorang yang menyewa orang upahan dengan upah makanannya, maka ia menjawab, \"Tidak boleh, hingga ia memberitahukan jumlahnya.\""
            },
            {
                "number": 3800,
                "arab": "أَخْبَرَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ حَمَّادٍ وَقَتَادَةَفِي رَجُلٍ قَالَ لِرَجُلٍ أَسْتَكْرِي مِنْكَ إِلَى مَكَّةَ بِكَذَا وَكَذَا فَإِنْ سِرْتُ شَهْرًا أَوْ كَذَا وَكَذَا شَيْئًا سَمَّاهُ فَلَكَ زِيَادَةُ كَذَا وَكَذَا فَلَمْ يَرَيَا بِهِ بَأْسًا وَكَرِهَا أَنْ يَقُولَ أَسْتَكْرِي مِنْكَ بِكَذَا وَكَذَا فَإِنْ سِرْتُ أَكْثَرَ مِنْ شَهْرٍ نَقَصْتُ مِنْ كِرَائِكَ كَذَا وَكَذَا",
                "id": "Telah mengabarkan kepada kami [Muhammad] ia berkata; telah menceritakan kepada kami [Hibban] ia berkata; telah memberitakan kepada kami [Abdullah] dari [Ma'mar] dari [Hammad] dan [Qatadah] mengenai seorang laki-laki yang berkata kepada orang yang lain, 'Aku ingin menyewa kamu (untuk mengantar) menuju Makkah dengan upah sekian dan sekian, jika aku pergi selama sebulan. Atau sekian dan sekian -lalu ia menyebutkan lama waktunya-, maka kamu akan mendapatkan tambahan sekian dan sekian.' Mereka berdua memandang hal tersebut tidak mengapa, dan mereka tidak menyukai untuk mengatakan, 'Aku akan menyewa darimu dengan upah sekian dan sekian, jika aku berjalan lebih dari satu bulan maka aku akan mengurangi sewaanmu sekian dan sekian'.\""
            },
            {
                "number": 3801,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ ابْنِ جُرَيْجٍ قِرَاءَةً قَالَ قُلْتُ لِعَطَاءٍعَبْدٌ أُؤَاجِرُهُ سَنَةً بِطَعَامِهِ وَسَنَةً أُخْرَى بِكَذَا وَكَذَا قَالَ لَا بَأْسَ بِهِ وَيُجْزِئُهُ اشْتِرَاطُكَ حِينَ تُؤَاجِرُهُ أَيَّامًا أَوْ آجَرْتَهُ وَقَدْ مَضَى بَعْضُ السَّنَةِ قَالَ إِنَّكَ لَا تُحَاسِبُنِي لِمَا مَضَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] telah memberitakan kepada kami [Hibban] telah memberitakan kepada kami [Abdullah] dari [Ibnu Juraij] dengan membacakan riwayat, dia berkata; \"Saya berkata kepada ['Atho']; ada seorang budak yang aku pekerjakan selama setahun dengan upah memberinya makanan, dan tahun yang lain dengan ini dan itu. Dia menjawab hal itu tidaklah mengapa dan cukup baginya dengan memberinya persyaratanmu ketika engkau mempekerjakannya selama beberapa hari atau engkau telah mempekerjakannya dan telah berjalan beberapa tahun, ia berkata sesungguhnya engkau tidak menghitungku dari apa yang telah berlalu."
            },
            {
                "number": 3802,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا خَالِدٌ هُوَ ابْنُ الْحَارِثِ قَالَ قَرَأْتُ عَلَى عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ أَخْبَرَنِي أَبِي عَنْ رَافِعِ بْنِ أُسَيْدِ بْنِ ظُهَيْرٍ عَنْ أَبِيهِ أُسَيْدِ بْنِ ظُهَيْرٍأَنَّهُ خَرَجَ إِلَى قَوْمِهِ إِلَى بَنِي حَارِثَةَ فَقَالَ يَا بَنِي حَارِثَةَ لَقَدْ دَخَلَتْ عَلَيْكُمْ مُصِيبَةٌ قَالُوا مَا هِيَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ الْأَرْضِ قُلْنَا يَا رَسُولَ اللَّهِ إِذًا نُكْرِيهَا بِشَيْءٍ مِنْ الْحَبِّ قَالَ لَا قَالَ وَكُنَّا نُكْرِيهَا بِالتِّبْنِ فَقَالَ لَا وَكُنَّا نُكْرِيهَا بِمَا عَلَى الرَّبِيعِ السَّاقِي قَالَ لَا ازْرَعْهَا أَوْ امْنَحْهَا أَخَاكَخَالَفَهُ مُجَاهِدٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ibrahim] telah memberitakan kepada kami [Khalid yaitu Ibnu Al Harits], dia berkata; \"Saya membacakan riwayat kepada [Abdul Hamid bin Ja'far], telah mengabarkan kepadaku [ayahku] dari [Rafi' bin Usaid bin Zhuhair] dari [ayahnya yaitu Usaid bin Zhuhair] bahwa dia keluar kepada kaumnya yaitu Bani Haritsah, lalu berkata; \"Wahai Bani Haritsah, sesungguhnya musibah telah menimpa kalian.\" Mereka bertanya; \"Apa itu?\" Dia menjawab; \"Rasulullah shallallahu 'alaihi wasallam melarang dari menyewakan tanah, kami berkata; wahai Rasulullah bagaimana jika kami menyewakan dengan sedikit biji-bijian, beliau menjawab: \" Tidak, \" ia berkata dan kami dahulu menyewakannya dengan jerami, beliau menjawab: \" Tidak, \" kami menyewakannya dengan sesuatu yang ditanam dengan pengairan sungai kecil, beliau bersabda: \" Tidak, tanamilah tanah tersebut atau berikan kepada saudaramu.\" Mujahid menyelisihi hadits tersebut."
            },
            {
                "number": 3803,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ آدَمَ قَالَ حَدَّثَنَا مُفَضَّلٌ وَهُوَ ابْنُ مُهَلْهَلٍ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أُسَيْدِ بْنِ ظُهَيْرٍ قَالَ جَاءَنَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَاكُمْ عَنْ الْحَقْلِ وَالْحَقْلُ الثُّلُثُ وَالرُّبُعُ وَعَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ شِرَاءُ مَا فِي رُءُوسِ النَّخْلِ بِكَذَا وَكَذَا وَسْقًا مِنْ تَمْرٍ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak telah menceritakan kepada kami Yahya yaitu Ibnu Adam telah menceritakan kepada kami Mufadhdhal yaitu Ibnu Muhalhal dari Manshur dari Mujahid dari Usaid bin Zhuhair, dia berkata: \"Telah datang kepada kami Rafi' bin Khadij kemudian berkata: \"Sesungguhnya Rasulullah shallallahu 'alaihi wa sallam telah melarang kalian dari haql (akad mengerjakan tanah dengan bagi hasill), haql adalah sepertiga, dan seperempat dan melarang dari muzabanah, dan muzabanah adalah membeli buah yang ada pada pohon kurma dengan sekian dan sekian wasaq (60 sha') dari buah kurma.\""
            },
            {
                "number": 3804,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ سَمِعْتُ مُجَاهِدًا يُحَدِّثُ عَنْ أُسَيْدِ بْنِ ظُهَيْرٍ قَالَأَتَانَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَاعَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرٌ لَكُمْ نَهَاكُمْ عَنْ الْحَقْلِ وَقَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَمْنَحْهَا أَوْ لِيَدَعْهَا وَنَهَى عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ الرَّجُلُ يَكُونُ لَهُ الْمَالُ الْعَظِيمُ مِنْ النَّخْلِ فَيَجِيءُ الرَّجُلُ فَيَأْخُذُهَا بِكَذَا وَكَذَا وَسْقًا مِنْ تَمْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Syu'bah] dari [Manshur], saya mendengar [Mujahid] menceritakan dari [Usaid bin Zhuhair], dia berkata; telah datang kepada kami [Rafi' bin Khadij] kemudian berkata; \"Rasulullah shallallahu 'alaihi wasallam telah melarang kami dari perkara yang dahulu memberikan manfaat bagi kami, sedang mentaati Rasulullah shallallahu 'alaihi wasallam adalah lebih baik bagi kalian. Beliau telah melarang dari haql, beliau bersabda: \"Barang siapa yang memiliki tanah maka hendaknya dia memberikannya atau meninggalkannya.\" Dan beliau melarang dari muzabanah, dan muzabanah adalah seseorang memiliki banyak harta dari pohon kurma kemudian seseorang datang dan mengambilnya dengan sekian dan sekian wasaq dari buah kurma.\""
            },
            {
                "number": 3805,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أُسَيْدِ بْنِ ظُهَيْرٍ قَالَأَتَى عَلَيْنَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ وَلَمْ أَفْهَمْ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَاكُمْ عَنْ أَمْرٍ كَانَ يَنْفَعُكُمْ وَطَاعَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرٌ لَكُمْ مِمَّا يَنْفَعُكُمْ نَهَاكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَقْلِ وَالْحَقْلُ الْمُزَارَعَةُ بِالثُّلُثِ وَالرُّبُعِ فَمَنْ كَانَ لَهُ أَرْضٌ فَاسْتَغْنَى عَنْهَا فَلْيَمْنَحْهَا أَخَاهُ أَوْ لِيَدَعْ وَنَهَاكُمْ عَنْ الْمُزَابَنَةِ وَالْمُزَابَنَةُ الرَّجُلُ يَجِيءُ إِلَى النَّخْلِ الْكَثِيرِ بِالْمَالِ الْعَظِيمِ فَيَقُولُ خُذْهُ بِكَذَا وَكَذَا وَسْقًا مِنْ تَمْرِ ذَلِكَ الْعَامِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Mujahid] dari [Usaid bin Zhuhair], dia berkata; telah datang kepada kami [Rafi' bin Khadij] kemudian berbicara dan saya belum faham, dia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang kalian dari perkara yang dahulu memberikan manfaat bagi kalian, dan mentaati Rasulullah shallallahu 'alaihi wasallam adalah lebih baik bagi kalian daripada sesuatu yang memberikan manfaat kepada kalian. Rasulullah shallallahu 'alaihi wasallam melarang kalian dari haql dan haql adalah mempekerjakan orang menggarap tanah dengan bagian sepertiga atau seperempat. Maka barang siapa yang memiliki tanah kemudian dia tidak membutuhkannya maka hendaknya dia memberikannya kepada saudaranya atau membiarkannya. Dan beliau melarang dari muzabanah, muzabanah adalah seseorang datang ke pohon kurma yang banyak dengan membawa harta yang banyak kemudian berkata; \"Ambillah dengan sekian dan sekian wasaq kurma tahun tersebut.\""
            },
            {
                "number": 3806,
                "arab": "أَخْبَرَنِي إِسْحَاقُ بْنُ يَعْقُوبَ بْنِ إِسْحَقَ الْبَغْدَادِيُّ أَبُو مُحَمَّدٍ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ مُجَاهِدٍ قَالَ حَدَّثَنِي أُسَيْدُ بْنُ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَافِعُ بْنُ خَدِيجٍ نَهَاكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَاعَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْفَعُ لَنَا قَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ عَجَزَ عَنْهَا فَلْيُزْرِعْهَا أَخَاهُ خَالَفَهُ عَبْدُ الْكَرِيمِ بْنُ مَالِكٍ",
                "id": "Telah mengabarkan kepada kami Ishaq bin Ya'qub bin Ishaq Al Baghdadi Abu Muhammad telah menceritakan kepada kami 'Affan telah menceritakan kepada kami Abdul Wahid telah menceritakan kepada kami Sa'id bin Abdur Rahman dari Mujahid telah menceritakan kepadaku Usaid bin Rafi' bin Khadij, dia berkata: Rafi' bin Khadij berkata: \"Rasulullah shallallahu 'alaihi wa sallam telah melarang kalian dari perkara yang dahulu memberikan manfaat bagi kita, dan mentaati Rasulullah shallallahu 'alaihi wa sallam adalah lebih bermanfaat bagi kita. Sedang mentaati Rasulullah shallallahu 'alaihi wa sallam lebih bermanfaat bagi kita. Beliau bersabda: \"Barang siapa yang memiliki tanah maka hendaknya dia menanaminya, apabila dia tidak mampu maka hendaknya dia meminta saudaranya agar menanaminya.\" Abdul Karim bin Malik menyelisihi hadits tersebut.\""
            },
            {
                "number": 3807,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ قَالَ أَخَذْتُ بِيَدِ طَاوُسٍ حَتَّى أَدْخَلْتُهُ عَلَى ابْنِ رَافِعِ بْنِ خَدِيجٍ فَحَدَّثَهُ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ كِرَاءِ الْأَرْضِفَأَبَى طَاوُسٌ فَقَالَ سَمِعْتُ ابْنَ عَبَّاسٍ لَا يَرَى بِذَلِكَ بَأْسًا وَرَوَاهُ أَبُو عَوَانَةَ عَنْ أَبِي حَصِينٍ عَنْ مُجَاهِدٍ قَالَ قَالَ عَنْ رَافِعٍ مُرْسَلًا",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] telah memberitakan kepada kami ['Ubaidullah yaitu Ibnu 'Amru] dari [Abdul Karim] dari [Mujahid], dia berkata; \"Saya menggandeng tangan Thawus hingga saya menggamitkannya dengan [anak Rafi' bin Khadij], kemudian dia menceritakan kepadanya dari [ayahnya] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau melarang dari menyewakan tanah. Kemudian Thawus menolak dan berkata; \"Saya telah mendengar Ibnu Abbas bahwa dia melihat hal tersebut tidak mengapa.\" Dan hadits tersebut diriwayatkan oleh Abu 'Awanah dari Abu Hashin dari Mujahid, dia berkata; telah berkata Rafi'....secara mursal.\""
            },
            {
                "number": 3808,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي حَصِينٍ عَنْ مُجَاهِدٍ قَالَقَالَ رَافِعُ بْنُ خَدِيجٍ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَأَمْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الرَّأْسِ وَالْعَيْنِ نَهَانَا أَنْ نَتَقَبَّلَ الْأَرْضَ بِبَعْضِ خَرْجِهَاتَابَعَهُ إِبْرَاهِيمُ بْنُ مُهَاجِرٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Hashin] dari [Mujahid], ia berkata; telah berkata [Rafi' bin Khadij]; Rasulullah shallallahu 'alaihi wasallam telah melarang kita dari perkara yang dahulu bermanfaat bagi kita, dan perintah Rasulullah shallallahu 'alaihi wasallam adalah sesuatu yang wajib. Beliau telah melarang kita untuk menerima tanahdengan sebagian hasilnya. Hadits tersebut disetujui oleh Ibrahim bin Muhajir. "
            },
            {
                "number": 3809,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَمَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَرْضِ رَجُلٍ مِنْ الْأَنْصَارِ قَدْ عَرَفَ أَنَّهُ مُحْتَاجٌ فَقَالَ لِمَنْ هَذِهِ الْأَرْضُ قَالَ لِفُلَانٍ أَعْطَانِيهَا بِالْأَجْرِ فَقَالَ لَوْ مَنَحَهَا أَخَاهُ فَأَتَى رَافِعٌ الْأَنْصَارَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَاكُمْ عَنْ أَمْرٍ كَانَ لَكُمْ نَافِعًا وَطَاعَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْفَعُ لَكُمْ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dari ['Ubaidullah] telah menceritakan kepada kami [Israil] dari [Ibrahim bin Muhajir] dari [Mujahid] dari [Rafi' bin Khadij], dia berkata; \"Nabi shallallahu 'alaihi wasallam melewati tanah seorang laki-laki Anshar dan beliau telah mengetahui bahwa dia membutuhkan (tanah tersebut), kemudian beliau bersabda: \"Milik siapakah tanah ini?\" Dia berkata; \"Milik Fulan. Dia memberikannya kepadaku dengan upah (disewakan). Kemudian beliau bersabda; \"\"Andai saja dia (mau) memberikannya kepada saudaranya.\" Kemudian Rafi' mendatangi orang-orang Anshar lalu berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang kalian dari perkara yang dahulu memberikan manfaat bagi kalian, dan ketaatan kepada Rasulullah shallallahu 'alaihi wasallam adalah lebih bermanfaat bagi kalian.\""
            },
            {
                "number": 3810,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَقْلِ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna dan Muhammad bin Basysyar, mereka berdua berkata: telah menceritakan kepada kami Muhammad telah menceritakan kepada kami Syu'bah dari Al Hakam dari Mujahid dari Rafi' bin Khadij, dia berkata: \"Rasulullah shallallahu 'alaihi wa sallam melarang dari haql.\""
            },
            {
                "number": 3811,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ خَالِدٍ وَهُوَ ابْنُ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ عَنْ مُجَاهِدٍ قَالَ حَدَّثَ رَافِعُ بْنُ خَدِيجٍ قَالَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَانَا عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا فَقَالَ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ يَمْنَحْهَا أَوْ يَذَرْهَا",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] dari [Khalid] yaitu Ibnu Al Harits telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik] dari [Mujahid], dia berkata; [Rafi' bin Khadij] telah menceritakan, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam keluar menemui kami kemudian melarang kami dari perkara yang dahulunya memberikan manfaat bagi kami. Beliau bersabda: \"Barang siapa yang memiliki tanah hendaknya dia menanaminya atau memberikannya atau membiarkannya.\""
            },
            {
                "number": 3812,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنِي شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ عَنْ عَطَاءٍ وَطَاوُسٍ وَمُجَاهِدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَانَا عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَأَمْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرٌ لَنَا قَالَ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَذَرْهَا أَوْ لِيَمْنَحْهَاوَمِمَّا يَدُلُّ عَلَى أَنَّ طَاوُسًا لَمْ يَسْمَعْ هَذَا الْحَدِيثَ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Khalid] telah menceritakan kepada kami [Hajjaj] telah menceritakan kepadaku [Syu'bah] dari [Abdul Malik] dari ['Atho`] dan [Thawus] serta [Mujahid] dari [Rafi' bin Khadij], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam keluar menemui kami, kemudian melarang kami dari perkara yang dahulunya memberikan manfaat bagi kami, dan perintah Rasulullah shallallahu 'alaihi wasallam adalah lebih baik bagi kami. Beliau bersabda: \"Barang siapa yang memiliki tanah maka hendaknya dia menanaminya atau membiarkannya atau memberikanya.\" (Akan tetapi) ada beberapa hal yang menunjukkan bahwa Thawus tidak mendengar hadits ini."
            },
            {
                "number": 3813,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ كَانَ طَاوُسٌ يَكْرَهُ أَنْ يُؤَاجِرَ أَرْضَهُ بِالذَّهَبِ وَالْفِضَّةِ وَلَا يَرَى بِالثُّلُثِ وَالرُّبُعِ بَأْسًا فَقَالَ لَهُ مُجَاهِدٌ اذْهَبْ إِلَى ابْنِ رَافِعِ بْنِ خَدِيجٍ فَاسْمَعْ مِنْهُ حَدِيثَهُ فَقَالَ إِنِّي وَاللَّهِ لَوْ أَعْلَمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ مَا فَعَلْتُهُ وَلَكِنْ حَدَّثَنِي مَنْ هُوَ أَعْلَمُ مِنْهُ ابْنُ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا قَالَ لَأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ أَرْضَهُ خَيْرٌ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرَاجًا مَعْلُومًا وَقَدْ اخْتُلِفَ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ فَقَالَ عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ عَنْ عَطَاءٍ عَنْ رَافِعٍ وَقَدْ تَقَدَّمَ ذِكْرُنَا لَهُ وَقَالَ عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرٍ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak telah menceritakan kepada kami Zakariya bin Adi telah menceritakan kepada kami Hammad bin Zaid dari 'Amru bin Dinar, dia berkata: \" Thawus tidak suka untuk menyewakan tanahnya dengan emas dan perak, dan dia berpendapat tidak mengapa menyewakannya dengan sepertiga dan seperempat bagian. Kemudian Mujahid berkata kepadanya: \"Pergilah kepada Rafi' bin Khadij, kemudian dengarkanlah darinya haditsnya. Kemudian dia berkata: \"Sesungguhnya demi Allah, seandainya saya mengetahui bahwa Rasulullah shallallahu 'alaihi wa sallam melarang darinya maka saya tidak akan melakukannya, akan tetapi telah menceritakan kepadaku orang yang lebih alim darinya yaitu Ibnu Abbas bahwa Rasulullah shallallahu 'alaihi wa sallam sesungguhnya bersabda: \"Sungguh salah seorang di antara kalian memberikan lahannya kepada saudaranya lebih baik daripada dia mengambil hasilnya tertentu karena menyewakannya.\" Sungguh diperselisihkan atas 'Atho` dalam hadits ini. Abdul Malik bin Maisarah mengatakan dari 'Atho' dari Rafi'. Dan telah kami sebutkan hadits tersebut. Dan telah dikatakan oleh Abdul Malik bin Abu Sulaiman dari 'Atho` dari Jabir."
            },
            {
                "number": 3814,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ عَجَزَ أَنْ يَزْرَعَهَا فَلْيَمْنَحْهَا أَخَاهُ الْمُسْلِمَ وَلَا يُزْرِعْهَا إِيَّاهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Abdul Malik] dari ['Atho`] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memiliki tanah maka hendaknya ia menanaminya apabila tidak mampu untuk menanaminya maka hendaknya ia memberikannya kepada saudaranya yang muslim dan jangan memintanya untuk menanam untuk dirinya.\""
            },
            {
                "number": 3815,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ وَلَا يُكْرِيهَاتَابَعَهُ عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الْأَوْزَاعِيُّ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Abdul Malik] dari ['Atho`] dari [Jabir], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barang siapa yang memiliki tanah maka hendaknya dia menanaminya atau memberikannya kepada saudaranya dan janganlah dia menyewakannya.\" Hadits tersebut disetujui Abdur Rahman bin 'Amru Al Auza'i."
            },
            {
                "number": 3816,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ عَنْ يَحْيَى بْنِ حَمْزَةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ كَانَ لِأُنَاسٍ فُضُولُ أَرَضِينَ يُكْرُونَهَا بِالنِّصْفِ وَالثُّلُثِ وَالرُّبُعِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ يُزْرِعْهَا أَوْ يُمْسِكْهَا وَافَقَهُ مَطَرُ بْنُ طَهْمَانَ",
                "id": "Telah mengabarkan kepada kami Hisyam bin 'Ammar dari Yahya bin Hamzah telah menceritakan kepada kami Al Auza'i dari 'Atho` dari Jabir, dia berkata: \"Dahulu orang-orang memiliki kelebihan lahan, mereka menyewakannya dengan mendapatkan setengah, sepertiga, dan seperempat bagian. Kemudian Rasulullah shallallahu 'alaihi wa sallam bersabda: \\\"Barang siapa yang memiliki tanah maka hendaknya dia menanaminya atau meminta orang lain untuk menanamnya atau menahannya.\\\"\" Hadits tersebut disepakati oleh Mathar bin Thahman."
            },
            {
                "number": 3817,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ مُحَمَّدٍ وَهُوَ أَبُو عُمَيْرِ بْنُ النَّحَّاسِ وَعِيسَى بْنُ يُونُسَ هُوَ الْفَاخُورِيُّ قَالَا حَدَّثَنَا ضَمْرَةُ عَنْ ابْنِ شَوْذَبٍ عَنْ مَطَرٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا وَلَا يُؤَاجِرْهَا",
                "id": "Telah mengabarkan kepada kami Isa bin Muhammad yaitu Abu 'Umair bin An Nahhas dan Isa bin Yunus yaitu Al Fakhuri, mereka berkata: telah menceritakan kepada kami Dhamrah dari Ibnu Syaudzab dari Mathar dari 'Atho` dari Jabir bin Abdullah, dia berkata: \"Rasulullah shallallahu 'alaihi wa sallam berkhutbah kepada kami, lalu beliau bersabda: \\\"Barang siapa yang memiliki tanah maka hendaknya dia menanaminya atau meminta orang lain untuk menanaminya dan tidak menyewakannya.\\\"\""
            },
            {
                "number": 3818,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ يُونُسَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ مَطَرٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ رَفَعَهُ نَهَى عَنْ كِرَاءِ الْأَرْضِ وَافَقَهُ عَبْدُ الْمَلِكِ بْنُ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ عَلَى النَّهْيِ عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Isma'il bin Ibrahim dari Yunus telah menceritakan kepada kami Hammad dari Mathar dari 'Atho` dari Jabir, dan dia merafa'kannya, Rasulullah shallallahu 'alaihi wa sallam melarang dari menyewakan tanah. Dan hal tersebut disepakati oleh Abdul Malik bin Abdul Aziz bin Juraij atas pelarangan dari menyewakan tanah."
            },
            {
                "number": 3819,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا الْمُفَضَّلُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ وَأَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَبَيْعِ الثَّمَرِ حَتَّى يُطْعَمَ إِلَّا الْعَرَايَا تَابَعَهُ يُونُسُ بْنُ عُبَيْدٍ",
                "id": "Telah mengabarkan kepada kami Qutaibah telah menceritakan kepada kami Al Mufadhdhal dari Ibnu Juraij dari 'Atho` dan Abu Az Zubair dari Jabir bahwa Nabi shallallahu 'alaihi wa sallam melarang dari mukhabarah, muzabanah dan muhaqalah serta menjual buah hingga layak dimakan kecuali 'araya. Hal tersebut disetujui oleh Yunus bin 'Ubaid."
            },
            {
                "number": 3820,
                "arab": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ قَالَ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَعَنْ الثُّنْيَا إِلَّا أَنْ تُعْلَمَ",
                "id": "Telah mengabarkan kepada kami Ziyad bin Ayyub telah menceritakan kepada kami 'Abbad bin Al 'Awwam telah menceritakan kepada kami Sufyan bin Husain telah menceritakan kepada kami Yunus bin 'Ubaid dari 'Atho` dari Jabir bahwa Nabi shallallahu 'alaihi wa sallam melarang dari muhaqalah, muzabanah, mukhabarah dan tsunya kecuali diketahui."
            },
            {
                "number": 3821,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى قَالَ سَأَلَ عَطَاءٌ سُلَيْمَانَ بْنَ مُوسَى قَالَ حَدَّثَ جَابِرٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلَا يُكْرِيهَا أَخَاهُ",
                "id": "Telah mengabarkan kepada kami Ahmad bin Yahya telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Hammam bin Yahya, dia berkata: 'Atho` bertanya kepada Sulaiman bin Musa, dia berkata: Jabir menceritakan bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: \\\"Barang siapa yang memiliki tanah maka hendaknya dia menanaminya atau meminta saudaranya untuk menanaminya dan tidak menyewakannya kepada saudaranya.\\\""
            },
            {
                "number": 3822,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ قَالَ حَدَّثَنَا أَبُو تَوْبَةَ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحَقْلِ وَهِيَ الْمُزَابَنَةُ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Idris telah menceritakan kepada kami Abu Taubah telah menceritakan kepada kami Mu'awiyah bin Sallam dari Yahya bin Abi Katsir dari Yazid bin Nu'aim dari Jabir bin Abdullah bahwa Nabi shallallahu 'alaihi wa sallam melarang dari haql yaitu muzabanah."
            },
            {
                "number": 3823,
                "arab": "أَخْبَرَنَا الثِّقَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُزَابَنَةِ وَالْمُخَاضَرَةِ",
                "id": "Telah mengabarkan kepada kami Ats Tsiqah telah menceritakan kepada kami Hammad bin Mas'adah dari Hisyam bin Abu Abdullah dari Yahya bin Abu Katsir dari Abu Salamah dari Jabir bin Abdullah bahwa Nabi shallallahu 'alaihi wa sallam melarang dari muzabanah dan mukhadharah."
            },
            {
                "number": 3824,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ",
                "id": "Telah mengabarkan kepada kami 'Amru bin Ali telah menceritakan kepada kami Abdur Rahman telah menceritakan kepada kami Sufyan dari Sa'd bin Ibrahim dari Umar bin Abu Salamah dari ayahnya dari Abu Hurairah, dia berkata: Rasulullah shallallahu 'alaihi wa sallam melarang dari muhaqalah dan muzabanah."
            },
            {
                "number": 3825,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ آدَمَ قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak telah menceritakan kepada kami Yahya yaitu Ibnu Adam telah menceritakan kepada kami Abdur Rahim dari Muhammad bin 'Amru dari Abu Salamah dari Abu Sa'id Al Khudri, dia berkata: Rasulullah shallallahu 'alaihi wa sallam melarang dari muhaqalah dan muzabanah."
            },
            {
                "number": 3826,
                "arab": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حُمْرَانَ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ الْأَسْوَدِ بْنِ الْعَلَاءِ عَنْ أَبِي سَلَمَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ",
                "id": "Telah mengabarkan kepada kami Zakariya bin Yahya telah menceritakan kepada kami Muhammad bin Yazid bin Ibrahim telah menceritakan kepada kami Abdullah bin Humran telah menceritakan kepada kami Abdul Hamid bin Ja'far dari Al Aswad bin Al 'Ala` dari Abu Salamah dari Rafi' bin Khadij bahwa Rasulullah shallallahu 'alaihi wa sallam melarang dari muhaqalah dan muzabanah."
            },
            {
                "number": 3827,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو عَاصِمٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ مُرَّةَ قَالَ سَأَلْتُ الْقَاسِمَ عَنْ الْمُزَارَعَةِ فَحَدَّثَ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ قَالَ أَبُو عَبْد الرَّحْمَنِ مَرَّةً أُخْرَى",
                "id": "Telah mengabarkan kepada kami 'Amru bin Ali telah menceritakan kepada kami Abu 'Ashim telah menceritakan kepada kami Utsman bin Murrah, dia berkata: \"Saya bertanya kepada Al Qasim mengenai muzara'ah, maka dia menceritakan dari Rafi' bin Khadij bahwa Rasulullah shallallahu 'alaihi wa sallam melarang dari muhaqalah dan muzabanah.\" Hal itu dikatakan oleh Abu Abdur Rahman sekali lagi."
            },
            {
                "number": 3828,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ قَالَ أَبُو عَاصِمٍ عَنْ عُثْمَانَ بْنِ مُرَّةَ قَالَ سَأَلْتُ الْقَاسِمَ عَنْ كِرَاءِ الْأَرْضِ فَقَالَ قَالَ رَافِعُ بْنُ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ وَاخْتُلِفَ عَلَى سَعِيدِ بْنِ الْمُسَيَّبِ فِيهِ",
                "id": "Telah mengabarkan kepada kami 'Amru bin Ali telah menceritakan kepada kami Abu 'Ashim dari Utsman bin Murrah, dia berkata: \"Saya bertanya kepada Al Qasim mengenai penyewaan tanah, maka dia berkata: Rafi' bin Khadij berkata bahwa Rasulullah shallallahu 'alaihi wa sallam melarang dari penyewaan tanah.\" Dan hal tersebut diperselisihkan dari Sa'id bin Al Musayyab."
            },
            {
                "number": 3829,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ أَبِي جَعْفَرٍ الْخَطْمِيِّ وَاسْمُهُ عُمَيْرُ بْنُ يَزِيدَ قَالَ أَرْسَلَنِي عَمِّي وَغُلَامًا لَهُ إِلَى سَعِيدِ بْنِ الْمُسَيَّبِ أَسْأَلُهُ عَنْ الْمُزَارَعَةِ فَقَالَ كَانَ ابْنُ عُمَرَ لَا يَرَى بِهَا بَأْسًا حَتَّى بَلَغَهُ عَنْ رَافِعِ بْنِ خَدِيجٍ حَدِيثٌ فَلَقِيَهُ فَقَالَ رَافِعٌ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَنِي حَارِثَةَ فَرَأَى زَرْعًا فَقَالَ مَا أَحْسَنَ زَرْعَ ظُهَيْرٍ فَقَالُوا لَيْسَ لِظُهَيْرٍ فَقَالَ أَلَيْسَ أَرْضُ ظُهَيْرٍ قَالُوا بَلَى وَلَكِنَّهُ أَزْرَعَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا زَرْعَكُمْ وَرُدُّوا إِلَيْهِ نَفَقَتَهُ قَالَ فَأَخَذْنَا زَرْعَنَا وَرَدَدْنَا إِلَيْهِ نَفَقَتَهُ وَرَوَاهُ طَارِقُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدٍ وَاخْتُلِفَ عَلَيْهِ فِيهِ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Al Mutsanna telah menceritakan kepada kami Yahya dari Abu Ja'far Al Khathmi yang bernama 'Umair bin Yazid, dia berkata: \"Pamanku mengutusku bersama seorang budaknya kepada Sa'id bin Al Musayyab untuk bertanya kepadanya tentang muzara'ah. Maka dia berkata: Dahulu Ibnu Umar tidak melihatnya bermasalah hingga sampai kepadanya hadits dari Rafi' bin Khadij. Maka ia menemuinya dan Rafi' berkata: Nabi shallallahu 'alaihi wa sallam mendatangi Bani Haritsah lalu melihat tanaman dan bersabda: 'Alangkah bagusnya tanaman Zhuhair.' Mereka berkata: 'Itu bukan milik Zhuhair.' Beliau bersabda: 'Bukankah itu tanah Zhuhair?' Mereka menjawab: 'Benar, namun ia memintakan kami untuk menanaminya.' Maka Rasulullah shallallahu 'alaihi wa sallam bersabda: 'Ambillah tanaman kalian dan kembalikan nafkahnya kepadanya.'\""
            },
            {
                "number": 3830,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ طَارِقٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَقَالَ إِنَّمَا يَزْرَعُ ثَلَاثَةٌ رَجُلٌ لَهُ أَرْضٌ فَهُوَ يَزْرَعُهَا أَوْ رَجُلٌ مُنِحَ أَرْضًا فَهُوَ يَزْرَعُ مَا مُنِحَ أَوْ رَجُلٌ اسْتَكْرَى أَرْضًا بِذَهَبٍ أَوْ فِضَّةٍ",
                "id": "Telah mengabarkan kepada kami Qutaibah telah menceritakan kepada kami Abu Al Ahwash dari Thariq dari Sa'id bin Al Musayyab dari Rafi' bin Khadij, dia berkata: Rasulullah shallallahu 'alaihi wa sallam melarang dari muhaqalah dan muzabanah. Beliau bersabda: \"Yang menanam itu hanya tiga: orang yang memiliki tanah lalu menanaminya, orang yang diberi tanah lalu menanami pemberian tersebut, atau orang yang menyewa tanah dengan emas atau perak.\""
            },
            {
                "number": 3831,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ أَنْبَأَنَا إِسْرَائِيلُ عَنْ طَارِقٍ عَنْ سَعِيدٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ",
                "id": "Telah mengabarkan kepada kami Ahmad bin Sulaiman telah menceritakan kepada kami 'Ubaidullah bin Musa telah memberitakan kepada kami Israil dari Thariq dari Sa'id, dia berkata: Rasulullah shallallahu 'alaihi wa sallam melarang dari muhaqalah."
            },
            {
                "number": 3832,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيٍّ وَهُوَ ابْنُ مَيْمُونٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ طَارِقٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ لَا يُصْلِحُ الزَّرْعَ غَيْرُ ثَلَاثٍ أَرْضٍ يَمْلِكُ رَقَبَتَهَا أَوْ مِنْحَةٍ أَوْ أَرْضٍ بَيْضَاءَ يَسْتَأْجِرُهَا بِذَهَبٍ أَوْ فِضَّةٍ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Ali yaitu Ibnu Maimun telah menceritakan kepada kami Muhammad telah menceritakan kepada kami Sufyan dari Thariq, dia berkata: Saya mendengar Sa'id bin Al Musayyab berkata: \"Tidak sah tanaman kecuali pada tiga hal: tanah yang ia miliki, tanah pemberian, atau tanah kosong yang ia sewa dengan emas atau perak.\""
            },
            {
                "number": 3833,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ",
                "id": "Telah mengabarkan kepada kami Al Harits bin Miskin dengan cara dibacakan, dan aku mendengar, dari Ibnu Al Qasim, dia berkata: Malik menceritakan kepadaku dari Ibnu Syihab dari Sa'id bin Al Musayyab bahwa Rasulullah shallallahu 'alaihi wa sallam melarang dari muhaqalah dan muzabanah."
            },
            {
                "number": 3834,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنِي عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ عِكْرِمَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ ابْنِ لَبِيبَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ",
                "id": "Telah mengabarkan kepada kami 'Ubaidullah bin Sa'd bin Ibrahim telah menceritakan kepadaku pamanku, dia berkata: telah menceritakan kepada kami ayahku dari Muhammad bin 'Ikrimah dari Muhammad bin Abdur Rahman bin Labibah dari Sa'id bin Al Musayyab dari Sa'd bin Abu Waqqash."
            },
            {
                "number": 3835,
                "arab": "أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا أَيُّوبُ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ رَافِعِ بْنِ خَدِيجٍ",
                "id": "Telah mengabarkan kepada kami Ziyad bin Ayyub telah menceritakan kepada kami Ibnu 'Aliyah telah memberitakan kepada kami Ayyub dari Ya'la bin Hakim dari Sulaiman bin Yasar dari Rafi' bin Khadij."
            },
            {
                "number": 3836,
                "arab": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ",
                "id": "Telah mengabarkan kepada kami Zakariya bin Yahya telah menceritakan kepada kami Muhammad bin 'Ubaid telah menceritakan kepada kami Hammad dari Ayyub."
            },
            {
                "number": 3837,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ سَعِيدٍ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ",
                "id": "Telah mengabarkan kepada kami Isma'il bin Mas'ud telah menceritakan kepada kami Khalid bin Al Harits dari Sa'id dari Ya'la bin Hakim dari Sulaiman bin Yasar."
            },
            {
                "number": 3838,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا اللَّيْثُ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ عَنْ رَافِعِ بْنِ خَدِيجٍ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak telah menceritakan kepada kami Hujain bin Al Mutsanna telah menceritakan kepada kami Al Laits dari Rabi'ah bin Abu Abdur Rahman dari Hanzhalah bin Qais dari Rafi' bin Khadij."
            },
            {
                "number": 3839,
                "arab": "أَخْبَرَنِي الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا عِيسَى هُوَ ابْنُ يُونُسَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ الْأَنْصَارِيِّ",
                "id": "Telah mengabarkan kepada kami Al Mughirah bin Abdur Rahman telah menceritakan kepada kami Isa yaitu Ibnu Yunus telah menceritakan kepada kami Al Auza'i dari Rabi'ah bin Abu Abdur Rahman dari Hanzhalah bin Qais Al Anshari."
            },
            {
                "number": 3840,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا مَالِكٌ عَنْ رَبِيعَةَ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ",
                "id": "Telah mengabarkan kepada kami 'Amru bin Ali telah menceritakan kepada kami Yahya telah menceritakan kepada kami Malik dari Rabi'ah dari Hanzhalah bin Qais."
            },
            {
                "number": 3841,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ وَكِيعٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ قَالَ سَأَلْتُ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الْأَرْضِ الْبَيْضَاءِ بِالذَّهَبِ وَالْفِضَّةِ فَقَالَ حَلَالٌ لَا بَأْسَ بِهِ ذَلِكَ فَرْضُ الْأَرْضِ رَوَاهُ يَحْيَى بْنُ سَعِيدٍ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ وَرَفَعَهُ كَمَا رَوَاهُ مَالِكٌ عَنْ رَبِيعَةَ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak dari Waki' telah menceritakan kepada kami Sufyan dari Rabi'ah bin Abu Abdur Rahman dari Hanzhalah bin Qais, dia berkata: \"Saya bertanya kepada Rafi' bin Khadij mengenai penyewaan tanah kosong dengan imbalan emas dan perak. Dia menjawab: Halal, tidak mengapa dengannya, hal itu adalah upah tanah.\" Yahya bin Sa'id meriwayatkannya dari Hanzhalah bin Qais dan dia merafa'kannya sebagaimana Malik meriwayatkannya dari Rabi'ah."
            },
            {
                "number": 3842,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ أَرْضِنَا وَلَمْ يَكُنْ يَوْمَئِذٍ ذَهَبٌ وَلَا فِضَّةٌ فَكَانَ الرَّجُلُ يُكْرِي أَرْضَهُ بِمَا عَلَى الرَّبِيعِ وَالْأَقْبَالِ وَأَشْيَاءَ مَعْلُومَةٍ",
                "id": "Telah mengabarkan kepada kami Yahya bin Habib bin 'Arabi dari Hammad bin Zaid dari Yahya bin Sa'id dari Hanzhalah bin Qais dari Rafi' bin Khadij, dia berkata: \"Rasulullah shallallahu 'alaihi wa sallam melarang kami dari menyewakan tanah kami, sedangkan pada waktu itu belum ada emas dan perak. Maka seseorang menyewakan tanahnya dengan imbalan apa yang ada di tepi sungai, bagian depan aliran air, dan dengan imbalan sesuatu yang telah ditentukan.\""
            },
            {
                "number": 3843,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ عَنْ جُوَيْرِيَةَ عَنْ مَالِكٍ عَنْ الزُّهْرِيِّ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ ذَكَرَ نَحْوَهُ وَتَابَعَهُ عُقَيْلُ بْنُ خَالِدٍ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Yahya bin Abdullah telah menceritakan kepada kami Abdullah bin Muhammad bin Asma` dari Juwairiyah dari Malik dari Az Zuhri bahwa Salim bin Abdullah menyebutkan hadits semisal itu, dan dia diikuti oleh 'Uqail bin Khalid."
            },
            {
                "number": 3844,
                "arab": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ قَالَ حَدَّثَنَا أَبِي عَنْ جَدِّي قَالَ أَخْبَرَنِي عُقَيْلُ بْنُ خَالِدٍ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يُكْرِي أَرْضَهُ حَتَّى بَلَغَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ كَانَ يَنْهَى عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami Abdul Malik bin Syu'aib bin Al Laits bin Sa'd telah menceritakan kepada kami ayahku dari kakekku, dia berkata: telah mengabarkan kepadaku 'Uqail bin Khalid dari Ibnu Syihab, dia berkata: Salim bin Abdullah mengabarkan kepadaku bahwa Abdullah bin Umar dahulu menyewakan tanahnya hingga sampai kepadanya bahwa Rafi' bin Khadij melarang penyewaan tanah."
            },
            {
                "number": 3845,
                "arab": "فَلَقِيَهُ عَبْدُ اللَّهِ فَقَالَ يَا ابْنَ خَدِيجٍ مَاذَا تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كِرَاءِ الْأَرْضِ فَقَالَ رَافِعٌ سَمِعْتُ عَمَّيَّ وَكَانَا قَدْ شَهِدَا بَدْرًا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Kemudian Abdullah menemui Rafi' lalu berkata: \"Wahai Ibnu Khadij, apa yang engkau ceritakan dari Rasulullah shallallahu 'alaihi wa sallam mengenai penyewaan tanah?\" Rafi' menjawab: \"Aku mendengar dua pamanku yang telah menyaksikan perang Badr bahwa Rasulullah shallallahu 'alaihi wa sallam melarang dari penyewaan tanah.\""
            },
            {
                "number": 3846,
                "arab": "قَالَ عَبْدُ اللَّهِ فَخَشِيتُ أَنْ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْدَثَ فِي ذَلِكَ شَيْئًا لَمْ أَكُنْ أَعْلَمُهُ فَتَرَكْتُ كِرَاءَ الْأَرْضِ أَرْسَلَهُ شُعَيْبُ بْنُ أَبِي حَمْزَةَ",
                "id": "Abdullah berkata: \"Aku khawatir Rasulullah shallallahu 'alaihi wa sallam telah menetapkan suatu perkara yang tidak aku ketahui, maka aku pun meninggalkan penyewaan tanah.\" Hadits ini dimursalkan oleh Syu'aib bin Abu Hamzah."
            },
            {
                "number": 3847,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ قَالَ بَلَغَنَا أَنَّ رَافِعَ بْنَ خَدِيجٍ كَانَ يُحَدِّثُ أَنَّ عَمَّيْهِ شَهِدَا بَدْرًا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Khalid bin Khalli telah menceritakan kepada kami Bisyr bin Syu'aib dari ayahnya dari Az Zuhri, dia berkata: \"Telah sampai kepada kami bahwa Rafi' bin Khadij menceritakan bahwa dua pamannya yang menyaksikan perang Badr mengatakan bahwa Rasulullah shallallahu 'alaihi wa sallam melarang penyewaan tanah.\""
            },
            {
                "number": 3848,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ عَنْ شُعَيْبٍ قَالَ الزُّهْرِيُّ كَانَ ابْنُ الْمُسَيَّبِ يَقُولُ لَا بَأْسَ بِاسْتِكْرَاءِ الْأَرْضِ بِالذَّهَبِ وَالْوَرِقِ",
                "id": "Telah mengabarkan kepada kami Ahmad bin Muhammad bin Al Mughirah telah menceritakan kepada kami Utsman bin Sa'id dari Syu'aib, Az Zuhri berkata: \"Ibnu Al Musayyab berkata bahwa tidak mengapa menyewa tanah dengan emas dan perak.\""
            },
            {
                "number": 3849,
                "arab": "وَكَانَ رَافِعُ بْنُ خَدِيجٍ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ وَافَقَهُ عَلَى إِرْسَالِهِ عَبْدُ الْكَرِيمِ بْنُ الْحَارِثِ",
                "id": "Rafi' bin Khadij menceritakan bahwa Rasulullah shallallahu 'alaihi wa sallam melarang dari penyewaan tanah, dan pemursalan hadits tersebut disepakati oleh Abdul Karim bin Al Harits."
            },
            {
                "number": 3850,
                "arab": "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي أَبُو خُزَيْمَةَ عَبْدُ اللَّهِ بْنُ طَرِيفٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ الْحَارِثِ عَنْ ابْنِ شِهَابٍ أَنَّ رَافِعَ بْنَ خَدِيجٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami Al Harits bin Miskin dari Ibnu Wahb, dia berkata: telah mengabarkan kepadaku Abu Khuzaimah Abdullah bin Tharif dari Abdul Karim bin Al Harits dari Ibnu Syihab bahwa Rafi' bin Khadij berkata: \"Rasulullah shallallahu 'alaihi wa sallam melarang dari penyewaan tanah.\""
            },
            {
                "number": 3851,
                "arab": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعْيَنَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ كَثِيرِ بْنِ فَرْقَدٍ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يُكْرِي الْمَزَارِعَ فَحُدِّثَ أَنَّ رَافِعَ بْنَ خَدِيجٍ يَأْثُرُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ ذَلِكَ",
                "id": "Telah mengabarkan kepadaku Abdur Rahman bin Abdullah bin Abdul Hakam bin A'yan, ia berkata: telah menceritakan kepada kami Syu'aib bin Al Laits dari ayahnya dari Katsir bin Farqad dari Nafi' bahwa Abdullah bin Umar dahulu menyewakan ladang, lalu ia diberitahu bahwa Rafi' bin Khadij meriwayatkan dari Rasulullah shallallahu 'alaihi wa sallam bahwa beliau melarang hal tersebut."
            },
            {
                "number": 3852,
                "arab": "قَالَ نَافِعٌ فَخَرَجَ إِلَيْهِ عَلَى الْبَلَاطِ وَأَنَا مَعَهُ فَسَأَلَهُ فَقَالَ نَعَمْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ الْمَزَارِعِ فَتَرَكَ عَبْدُ اللَّهِ كِرَاءَهَا",
                "id": "Nafi' berkata: kemudian ia keluar menemuinya di atas ubin dan aku bersamanya, lalu ia bertanya kepadanya. Rafi' berkata: \"Ya, Rasulullah shallallahu 'alaihi wa sallam telah melarang penyewaan ladang.\" Maka Abdullah pun meninggalkan penyewaannya."
            },
            {
                "number": 3853,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ",
                "id": "Telah mengabarkan kepada kami Isma'il bin Mas'ud, ia berkata: telah menceritakan kepada kami Khalid bin Al Harits, ia berkata: telah menceritakan kepada kami 'Ubaidullah bin Umar dari Nafi'."
            },
            {
                "number": 3854,
                "arab": "أَنَّ رَجُلًا أَخْبَرَ ابْنَ عُمَرَ أَنَّ رَافِعَ بْنَ خَدِيجٍ يَأْثُرُ فِي كِرَاءِ الْأَرْضِ حَدِيثًا",
                "id": "Bahwa seseorang mengabarkan kepada Ibnu Umar bahwa Rafi' bin Khadij meriwayatkan hadits tentang penyewaan tanah."
            },
            {
                "number": 3855,
                "arab": "فَانْطَلَقْتُ مَعَهُ أَنَا وَالرَّجُلُ الَّذِي أَخْبَرَهُ حَتَّى أَتَى رَافِعًا فَأَخْبَرَهُ رَافِعٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Aku dan orang yang mengabarkannya pun pergi bersamanya hingga mendatangi Rafi'. Rafi' lalu mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wa sallam melarang penyewaan tanah."
            },
            {
                "number": 3856,
                "arab": "فَتَرَكَ عَبْدُ اللَّهِ كِرَاءَ الْأَرْضِ",
                "id": "Maka Abdullah pun meninggalkan penyewaan tanah."
            },
            {
                "number": 3857,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا جُوَيْرِيَةُ عَنْ نَافِعٍ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Yazid Al Muqri', ia berkata: telah menceritakan kepada kami ayahku, ia berkata: telah menceritakan kepada kami Juwairiyah dari Nafi'."
            },
            {
                "number": 3858,
                "arab": "أَنَّ رَافِعَ بْنَ خَدِيجٍ حَدَّثَ عَبْدَ اللَّهِ بْنَ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْمَزَارِعِ",
                "id": "Bahwa Rafi' bin Khadij menceritakan kepada Abdullah bin Umar bahwa Rasulullah shallallahu 'alaihi wa sallam melarang penyewaan ladang."
            },
            {
                "number": 3859,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ",
                "id": "Telah mengabarkan kepada kami Hisyam bin 'Ammar, ia berkata: telah menceritakan kepada kami Yahya bin Hamzah, ia berkata: telah menceritakan kepada kami Al Auza'i."
            },
            {
                "number": 3860,
                "arab": "عَنْ حَفْصِ بْنِ عِنَانٍ عَنْ نَافِعٍ أَنَّهُ قَالَ كَانَ ابْنُ عُمَرَ يُكْرِي أَرْضَهُ بِبَعْضِ مَا يَخْرُجُ مِنْهَا",
                "id": "Dari Hafsh bin 'Inan dari Nafi', ia berkata: dahulu Ibnu Umar menyewakan tanahnya dengan sebagian dari hasilnya."
            },
            {
                "number": 3861,
                "arab": "فَبَلَغَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ يَزْجُرُ عَنْ ذَلِكَ وَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ",
                "id": "Lalu sampai kepadanya bahwa Rafi' bin Khadij melarang hal tersebut dan berkata bahwa Rasulullah shallallahu 'alaihi wa sallam melarangnya."
            },
            {
                "number": 3862,
                "arab": "فَقَالَ رَافِعٌ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُكْرُوا الْأَرْضَ بِشَيْءٍ",
                "id": "Rafi' berkata: \"Aku mendengar Nabi shallallahu 'alaihi wa sallam bersabda: Janganlah kalian menyewakan tanah dengan sesuatu.\""
            },
            {
                "number": 3863,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ عَبْدِ الْوَهَّابِ عَنْ هِشَامٍ عَنْ مُحَمَّدٍ وَنَافِعٍ عَنْ رَافِعِ بْنِ خَدِيجٍ",
                "id": "Telah mengabarkan kepada kami Humaid bin Mas'adah dari Abdul Wahhab dari Hisyam dari Muhammad dan Nafi' dari Rafi' bin Khadij."
            },
            {
                "number": 3864,
                "arab": "أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Bahwa Rasulullah shallallahu 'alaihi wa sallam melarang penyewaan tanah."
            },
            {
                "number": 3865,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ",
                "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah bin Al Mubarak, ia berkata: telah memberitakan kepada kami Waki', ia berkata: telah menceritakan kepada kami Sufyan."
            },
            {
                "number": 3866,
                "arab": "قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ كُنَّا نُخَابِرُ وَلَا نَرَى بِذَلِكَ بَأْسًا حَتَّى زَعَمَ رَافِعُ بْنُ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُخَابَرَةِ",
                "id": "Ia berkata: aku mendengar Ibnu Umar berkata: \"Dahulu kami melakukan mukhabarah dan tidak melihatnya sebagai masalah, hingga Rafi' bin Khadij mengabarkan bahwa Rasulullah shallallahu 'alaihi wa sallam melarang mukhabarah.\""
            },
            {
                "number": 3867,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ قَالَ كَانَ مُحَمَّدٌ يَقُولُالْأَرْضُ عِنْدِي مِثْلُ مَالِ الْمُضَارَبَةِ فَمَا صَلُحَ فِي مَالِ الْمُضَارَبَةِ صَلُحَ فِي الْأَرْضِ وَمَا لَمْ يَصْلُحْ فِي مَالِ الْمُضَارَبَةِ لَمْ يَصْلُحْ فِي الْأَرْضِ قَالَ وَكَانَ لَا يَرَى بَأْسًا أَنْ يَدْفَعَ أَرْضَهُ إِلَى الْأَكَّارِ عَلَى أَنْ يَعْمَلَ فِيهَا بِنَفْسِهِ وَوَلَدِهِ وَأَعْوَانِهِ وَبَقَرِهِ وَلَا يُنْفِقَ شَيْئًا وَتَكُونَ النَّفَقَةُ كُلُّهَا مِنْ رَبِّ الْأَرْضِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Zurarah] telah memberitakan kepada kami [Isma'il] telah menceritakan kepada kami [Ibnu 'Aun], dia berkata; [Muhammad] pernah berkata; \"Tanahku seperti harta Mudharabah (kerjasama dagang dengan memberikan saham harta atau jasa), apa yang layak untuk harta mudharabah maka layak untuk tanahku dan apa yang tidak layak untuk harta mudharabah maka tak layak pula untuk tanahku. Dia memandang tidak mengapa jika dia menyerahkan tanahnya kepada pembajak tanah agar dikerjakan oleh pembajak tanah sendiri, anaknya dan orang-orang yang membantunya serta sapinya, pembajak tidak memberikan biaya sedikitpun, dan pembiayaannya semua dari pemilik tanah.\""
            },
            {
                "number": 3868,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْمَلُوهَا مِنْ أَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرَ مَا يَخْرُجُ مِنْهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Muhammad bin Abdur Rahman] dari [Nafi'] dari [Ibnu Umar radliallahu 'anhuma] bahwa Nabi shallallahu 'alaihi wasallam menyerahkan pohon kurma Khaibar dan tanahnya kepada orang-orang Yahudi agar mereka mengerjakannya dari harta mereka sedang Rasulullah shallallahu 'alaihi wasallam mendapatkan setengah dari apa yang keluar darinya. "
            },
            {
                "number": 3869,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ قَالَ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْمَلُوهَا بِأَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرَ ثَمَرَتِهَا",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Abdullah bin Abdul Hakam] telah menceritakan kepada kami [Syu'aib bin Al Laits] telah menceritakan kepada kami [ayahku] dari [Muhammad bin Abdur Rahman] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam menyerahkan pohon kurma Khaibar dan tanahnya kepada orang-orang Yahudi agar mereka menggarapnya dari harta mereka sedang Rasulullah shallallahu 'alaihi wasallam mendapatkan setengah dari buahnya."
            },
            {
                "number": 3870,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَقُولُكَانَتْ الْمَزَارِعُ تُكْرَى عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَنَّ لِرَبِّ الْأَرْضِ مَا عَلَى رَبِيعِ السَّاقِي مِنْ الزَّرْعِ وَطَائِفَةً مِنْ التِّبْنِ لَا أَدْرِي كَمْ هُوَ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Abdullah bin Abdul Hakam] telah menceritakan kepada kami [Syu'aib bin Al Laits] dari [ayahnya] dari [Muhammad bin Abdur Rahman] dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam dahulu sawah-sawah disewakan dan pemilik tanah berhak terhadap apa yang tumbuh di sekitar sungai kecil ladangnya dan sekelompok jerami, saya tidak tahu berapa itu.\""
            },
            {
                "number": 3871,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ قَالَكَانَ عَمَّايَ يَزْرَعَانِ بِالثُّلُثِ وَالرُّبُعِ وَأَبِي شَرِيكَهُمَا وَعَلْقَمَةُ وَالْأَسْوَدُ يَعْلَمَانِ فَلَا يُغَيِّرَانِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] telah memberitakan kepada kami [Syarik] dari [Abu Ishaq] dari [Abdur Rahman bin Al Aswad], dia berkata; \"Dua orang pamanku bercocok tanam dengan mendapatkan sepertiga dan seperempat dan ayahku bekerjasama dengan keduanya, [Alqomah] dan [Al Aswad] mengetahui hal itu namun mereka tidak mengingkarinya.\""
            },
            {
                "number": 3872,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ مَعْمَرًا عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ قَالَ قَالَ سَعِيدُ بْنُ جُبَيْرٍ قَالَ ابْنُ عَبَّاسٍإِنَّ خَيْرَ مَا أَنْتُمْ صَانِعُونَ أَنْ يُؤَاجِرَ أَحَدُكُمْ أَرْضَهُ بِالذَّهَبِ وَالْوَرِقِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] telah menceritakan kepada kami [Al Mu'tamir], dia berkata; \"Saya mendengar [Ma'mar] dari [Abdul Karim Aljazary], dia berkata; [Said bin Jubair] berkata; [Ibnu Abbas] berkata; \"Sesungguhnya sebaik-baik apa yang kalian perbuat adalah seseorang di antara kalian menyewakan tanahnya dengan upah emas atau perak.\""
            },
            {
                "number": 3873,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ وَسَعِيدِ بْنِ جُبَيْرٍأَنَّهُمَا كَانَا لَا يَرَيَانِ بَأْسًا بِاسْتِئْجَارِ الْأَرْضِ الْبَيْضَاءِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dan [Sa'id bin Jubair] bahwa keduanya berpendapat tidak mengapa menyewa tanah kosong."
            },
            {
                "number": 3874,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَ لَمْ أَعْلَمْ شُرَيْحًاكَانَ يَقْضِي فِي الْمُضَارِبِ إِلَّا بِقَضَاءَيْنِ كَانَ رُبَّمَا قَالَ لِلْمُضَارِبِ بَيِّنَتَكَ عَلَى مُصِيبَةٍ تُعْذَرُ بِهَا وَرُبَّمَا قَالَ لِصَاحِبِ الْمَالِ بَيِّنَتَكَ أَنَّ أَمِينَكَ خَائِنٌ وَإِلَّا فَيَمِينُهُ بِاللَّهِ مَا خَانَكَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Zurarah] telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Muhammad], dia berkata; \"Aku tidak tahu bahwa [Syuraih] memutuskan mengenai seseorang yang melakukan mudharabah kecuali dengan dua keputusan, suatu ketika dia mengatakan kepada pelaksana mudharabah; \"Berikanlah buktimu terhadap musibah yang dengannya engkau mendapatkan udzur\", atau suatu ketika dia mengatakan kepada pemilik harta; \"Berikan buktimu bahwa orang kepercayaanmu adalah orang yang berkhianat, jika tidak maka dia bersumpah dengan nama Allah bahwa dia tidak mengkhianatimu.\""
            },
            {
                "number": 3875,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ طَارِقٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَلَا بَأْسَ بِإِجَارَةِ الْأَرْضِ الْبَيْضَاءِ بِالذَّهَبِ وَالْفِضَّةِ وَقَالَ إِذَا دَفَعَ رَجُلٌ إِلَى رَجُلٍ مَالًا قِرَاضًا فَأَرَادَ أَنْ يَكْتُبَ عَلَيْهِ بِذَلِكَ كِتَابًا كَتَبَ هَذَا كِتَابٌ كَتَبَهُ فُلَانُ بْنُ فُلَانٍ طَوْعًا مِنْهُ فِي صِحَّةٍ مِنْهُ وَجَوَازِ أَمْرِهِ لِفُلَانِ بْنِ فُلَانٍ أَنَّكَ دَفَعْتَ إِلَيَّ مُسْتَهَلَّ شَهْرِ كَذَا مِنْ سَنَةِ كَذَا عَشَرَةَ آلَافِ دِرْهَمٍ وُضْحًا جِيَادًا وَزْنَ سَبْعَةٍ قِرَاضًا عَلَى تَقْوَى اللَّهِ فِي السِّرِّ وَالْعَلَانِيَةِ وَأَدَاءِ الْأَمَانَةِ عَلَى أَنْ أَشْتَرِيَ بِهَا مَا شِئْتُ مِنْهَا كُلَّ مَا أَرَى أَنْ أَشْتَرِيَهُ وَأَنْ أُصَرِّفَهَا وَمَا شِئْتُ مِنْهَا فِيمَا أَرَى أَنْ أُصَرِّفَهَا فِيهِ مِنْ صُنُوفِ التِّجَارَاتِ وَأَخْرُجَ بِمَا شِئْتُ مِنْهَا حَيْثُ شِئْتُ وَأَبِيعَ مَا أَرَى أَنْ أَبِيعَهُ مِمَّا أَشْتَرِيهِ بِنَقْدٍ رَأَيْتُ أَمْ بِنَسِيئَةٍ وَبِعَيْنٍ رَأَيْتُ أَمْ بِعَرْضٍ عَلَى أَنْ أَعْمَلَ فِي جَمِيعِ ذَلِكَ كُلِّهِ بِرَأْيِي وَأُوَكِّلَ فِي ذَلِكَ مَنْ رَأَيْتُ وَكُلُّ مَا رَزَقَ اللَّهُ فِي ذَلِكَ مِنْ فَضْلٍ وَرِبْحٍ بَعْدَ رَأْسِ الْمَالِ الَّذِي دَفَعْتَهُ الْمَذْكُورِ إِلَيَّ الْمُسَمَّى مَبْلَغُهُ فِي هَذَا الْكِتَابِ فَهُوَ بَيْنِي وَبَيْنَكَ نِصْفَيْنِ لَكَ مِنْهُ النِّصْفُ بِحَظِّ رَأْسِ مَالِكَ وَلِي فِيهِ النِّصْفُ تَامًّا بِعَمَلِي فِيهِ وَمَا كَانَ فِيهِ مِنْ وَضِيعَةٍ فَعَلَى رَأْسِ الْمَالِ فَقَبَضْتُ مِنْكَ هَذِهِ الْعَشَرَةَ آلَافِ دِرْهَمٍ الْوُضْحَ الْجِيَادَ مُسْتَهَلَّ شَهْرِ كَذَا فِي سَنَةِ كَذَا وَصَارَتْ لَكَ فِي يَدِي قِرَاضًا عَلَى الشُّرُوطِ الْمُشْتَرَطَةِ فِي هَذَا الْكِتَابِ أَقَرَّ فُلَانٌ وَفُلَانٌ وَإِذَا أَرَادَ أَنْ يُطْلِقَ لَهُ أَنْ يَشْتَرِيَ وَيَبِيعَ بِالنَّسِيئَةِ كَتَبَ وَقَدْ نَهَيْتَنِي أَنْ أَشْتَرِيَ وَأَبِيعَ بِالنَّسِيئَةِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] telah menceritakan kepada kami [Syarik] dari [Thariq] dari [Sa'id bin Al Musayyab], dia berkata; \"Tidak mengapa menyewakan tanah kosong dengan upah emas atau perak.\" Dia juga berkata; \"Jika seseorang membayar harta kepada orang lain dengan qirod (pemberian modal untuk berdagang dengan memperoleh bagian laba) dan dia ingin menuliskannya dalam surat lalu dia menulis; Ini adalah surat yang ditulis oleh fulan bin fulan dengan kerelaan darinya dalam keadaan sehat dan lisensinya untuk Fulan bin Fulan, bahwa engkau telah menyerahkan kepadaku pada permulaan bulan dari tahun ini, sebanyak sepuluh ribu dirham secara jelas dan baik dengan berat tujuh qiradh atas dasar ketakwaan kepada Allah baik dalam keadaan tersembunyi ataupun terang-terangan, serta menunaikan amanah agar saya membeli dengannya menurut kehendakku segala apa yang ingin saya beli, dan aku akan mengaturnya sekiranya saya pandang perlu untuk mengaturnya dari berbagai jenis perdagangan, dan akan aku keluarkan apa yang saya kehendaki kemana saja yang saya kehendaki dan menjual apa yang ingin saya jual dari barang yang telah saya beli, baik secara kontan atau kredit, baik dengan uang atau dengan barang dengan dasar saya mengerjakan semua itu sesuai pendapatku, dan saya akan mewakilkan dalam itu kepada orang yang kehendaki, dan setiap apa yang dirizqikan Allah dalam hal itu berupa kelebihan dan keuntungan diluar modal tersebut yang telah engkau serahkan kepadaku yang tertera banyaknya, didalam surat ini, maka hal itu dibagi antara saya dan engkau menjadi dua bagian, untukmu setengah sesuai dengan bagian modalmu, dan untukku setengah sesuai dengan pekerjaanku secara penuh, jika ada sesuatu yang hilang maka hal itu menjadi tanggungan modal. Saya terima sebanyak sepuluh ribu dirham secara jelas dan baik pada permulaan bulan ini pada tahun ini, dan menjadi qiradh milikmu yang ada padaku dengan persyaratan yang tercantum dalam surat ini. Telah menyatakan Fulan dan Fulan. Jika ia ingin membebaskannya untuk membeli dan menjual secara kredit, maka ia menulis; dan engkau telah melarangku untuk membeli dan menjualnya dengan kredit.\""
            },
            {
                "number": 3876,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَاشْتَرَكْتُ أَنَا وَعَمَّارٌ وَسَعْدٌ يَوْمَ بَدْرٍ فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ وَلَمْ أَجِئْ أَنَا وَلَا عَمَّارٌ بِشَيْءٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] telah menceritakan kepadaku [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah], dia berkata; \"Saya, 'Ammar dan Sa, d bersekutu pada perang Badr, kemudian Sa'd datang membawa dua orang tawanan, sedangkan saya dan Ammar tidak membawa sesuatupun.\""
            },
            {
                "number": 3877,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّفِي عَبْدَيْنِ مُتَفَاوِضَيْنِ كَاتَبَ أَحَدُهُمَا قَالَ جَائِزٌ إِذَا كَانَا مُتَفَاوِضَيْنِ يَقْضِي أَحَدُهُمَا عَنْ الْآخَرِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] telah memberitakan kepada kami [Ibnu Al Mubarak] dari [Yunus] dari [Az Zuhri] mengenai dua orang budak yang bersekutu dengan syarat-syarat tertentu, salah seorang dari mereka berjanji akan menebus salah seorang dari mereka. Az Zuhri berkata; \"Boleh jika mereka berdua bersekutu salah seorang dari mereka menebus untuk yang lainnya.\""
            }
  ]
}