{
    "kategori": "Kitab Pembagian Fa'i",
  "hadits": [
    {
                "number": 4064,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ يَزِيدَ بْنِ هُرْمُزَ أَنَّ نَجْدَةَ الْحَرُورِيَّ حِينَ خَرَجَ فِي فِتْنَةِ ابْنِ الزُّبَيْرِ أَرْسَلَ إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنْ سَهْمِ ذِي الْقُرْبَى لِمَنْ تُرَاهُ قَالَ هُوَ لَنَا لِقُرْبَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُمْ وَقَدْ كَانَ عُمَرُ عَرَضَ عَلَيْنَا شَيْئًا رَأَيْنَاهُ دُونَ حَقِّنَا فَأَبَيْنَا أَنْ نَقْبَلَهُ وَكَانَ الَّذِي عَرَضَ عَلَيْهِمْ أَنْ يُعِينَ نَاكِحَهُمْ وَيَقْضِيَ عَنْ غَارِمِهِمْ وَيُعْطِيَ فَقِيرَهُمْ وَأَبَى أَنْ يَزِيدَهُمْ عَلَى ذَلِكَ",
                "id": "Telah mengabarkan kepada kami Harun bin Abdullah Al Hammal, ia berkata: telah menceritakan kepada kami Utsman bin Umar dari Yunus bin Yazid dari Az Zuhri dari Yazid bin Hurmuz bahwa Najdah Al Haruri ketika ia keluar di saat terjadi fitnah mengenai Ibnu Az Zubair mengirimkan utusan kepada Ibnu Abbas bertanya kepadanya mengenai saham kaum kerabat, untuk siapakah saham tersebut? Ia berkata: saham tersebut untuk kami, untuk kerabat Rasulullah shallallahu 'alaihi wa sallam. Rasulullah shallallahu 'alaihi wa sallam telah membaginya untuk mereka, Umar pernah menawarkan kepada kami sesuatu yang kami lihat bukan sebagai hak kami, kemudian kami menolak untuk menerimanya. Dan sesuatu yang ia tawarkan kepada mereka adalah ia membantu orang yang menikah diantara mereka, dan membayar hutang orang yang berhutang diantara mereka, memberikan kepada orang fakir diantara mereka. Dan ia menolak untuk memberikan tambahan kepada mereka melebihi hal itu."
            },
            {
                "number": 4065,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ وَمُحَمَّدُ بْنُ عَلِيٍّ عَنْ يَزِيدَ بْنِ هُرْمُزَ قَالَكَتَبَ نَجْدَةُ إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنْ سَهْمِ ذِي الْقُرْبَى لِمَنْ هُوَ قَالَ يَزِيدُ بْنُ هُرْمُزَ وَأَنَا كَتَبْتُ كِتَابَ ابْنِ عَبَّاسٍ إِلَى نَجْدَةَ كَتَبْتُ إِلَيْهِ كَتَبْتَ تَسْأَلُنِي عَنْ سَهْمِ ذِي الْقُرْبَى لِمَنْ هُوَ وَهُوَ لَنَا أَهْلَ الْبَيْتِ وَقَدْ كَانَ عُمَرُ دَعَانَا إِلَى أَنْ يُنْكِحَ مِنْهُ أَيِّمَنَا وَيُحْذِيَ مِنْهُ عَائِلَنَا وَيَقْضِيَ مِنْهُ عَنْ غَارِمِنَا فَأَبَيْنَا إِلَّا أَنْ يُسَلِّمَهُ لَنَا وَأَبَى ذَلِكَ فَتَرَكْنَاهُ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yazid yaitu Ibnu Harun], ia berkata; telah memberitakan kepada kami [Muhammad bin Ishaq] dari [Az Zuhri] dan [Muhammad bin Ali] dari [Yazid bin Hurmuz], ia berkata; Najdah menulis surat kepada [Ibnu Abbas] bertanya mengenai saham kaum kerabat, untuk siapakah saham tersebut? Yazid bin Hurmuz berkata; dan saya yang menulis surat Ibnu Abbas kepada Najdah. Ia berkata; saya menulis kepadanya; engkau telah menulis surat kepadaku menanyakan mengenai saham kaum kerabat, untuk siapa saham tersebut? Saham tersebut untuk kami ahli bait. Dahulu Umar mengajak kami agar ia menikahkan janda kami dan memberi sebagian rampasan perang kepada orang miskin kami, serta membayar hutang orang yang memberi hutang diantara kami, kemudian kami menolak kecuali ia menyerahkannya kepada kami. Namun ia menolak sehingga kami meninggalkannya seperti itu. "
            },
            {
                "number": 4066,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى قَالَ حَدَّثَنَا مَحْبُوبٌ يَعْنِي ابْنَ مُوسَى قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ وَهُوَ الْفَزَارِيُّ عَنْ الْأَوْزَاعِيِّ قَالَكَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى عُمَرَ بْنِ الْوَلِيدِ كِتَابًا فِيهِ وَقَسْمُ أَبِيكَ لَكَ الْخُمُسُ كُلُّهُ وَإِنَّمَا سَهْمُ أَبِيكَ كَسَهْمِ رَجُلٍ مِنْ الْمُسْلِمِينَ وَفِيهِ حَقُّ اللَّهِ وَحَقُّ الرَّسُولِ وَذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ فَمَا أَكْثَرَ خُصَمَاءَ أَبِيكَ يَوْمَ الْقِيَامَةِ فَكَيْفَ يَنْجُو مَنْ كَثُرَتْ خُصَمَاؤُهُ وَإِظْهَارُكَ الْمَعَازِفَ وَالْمِزْمَارَ بِدْعَةٌ فِي الْإِسْلَامِ وَلَقَدْ هَمَمْتُ أَنْ أَبْعَثَ إِلَيْكَ مَنْ يَجُزُّ جُمَّتَكَ جُمَّةَ السُّوءِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya], ia berkata; telah menceritakan kepada kami [Mahbub yaitu Ibnu Musa], ia berkata; telah memberitakan kepada kami [Abu Ishaq yaitu Al Fazari] dari [Al Auza'I], ia berkata; [Umar bin Abdul Aziz] mengirim surat kepada Umar bin Walid yang isinya adalah: dan pembagian ayahmu kepadamu seperlima seluruhnya, sesungguhnya bagian ayahmu seperti bagian seseorang dari kaum muslimin dan didalamnya ada haq Allah dan haq rasul, kaum kerabat, anak-anak yatim, orang-orang miskin, dan Ibn Sabil, maka betapa banyak penuntut ayahmu pada hari kiamat kelak, dan bagaimana ia bisa selamat orang yang banyak penututnya, dan engkau menampakkan alat musik dan seruling adalah bid'ah didalam Islam dan sungguh aku ingin mengirim seseorang kepadamu untuk memotong rambutmu yaitu rambut yang buruk."
            },
            {
                "number": 4067,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ يَحْيَى قَالَ حَدَّثَنَا نَافِعُ بْنُ يَزِيدَ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ جُبَيْرَ بْنَ مُطْعِمٍ حَدَّثَهُ أَنَّهُ جَاءَ هُوَ وَعُثْمَانُ بْنُ عَفَّانَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَلِّمَانِهِ فِيمَا قَسَمَ مِنْ خُمُسِ حُنَيْنٍ بَيْنَ بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ بْنِ عَبْدِ مَنَافٍ فَقَالَا يَا رَسُولَ اللَّهِ قَسَمْتَ لِإِخْوَانِنَا بَنِي الْمُطَّلِبِ بْنِ عَبْدِ مَنَافٍ وَلَمْ تُعْطِنَا شَيْئًا وَقَرَابَتُنَا مِثْلُ قَرَابَتِهِمْ فَقَالَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا أَرَى هَاشِمًا وَالْمُطَّلِبَ شَيْئًا وَاحِدًا قَالَ جُبَيْرُ بْنُ مُطْعِمٍ وَلَمْ يَقْسِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِبَنِي عَبْدِ شَمْسٍ وَلَا لِبَنِي نَوْفَلٍ مِنْ ذَلِكَ الْخُمُسِ شَيْئًا كَمَا قَسَمَ لِبَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ",
                "id": "Telah mengabarkan kepada kami Abdurrahman bin Abdullah bin Abdul Hakam, ia berkata: telah menceritakan kepada kami Syu'aib bin Yahya, ia berkata: telah menceritakan kepada kami Nafi' bin Yazid dari Yunus bin Yazid dari Ibnu Syihab, ia berkata: telah mengabarkan kepadaku Sa'id bin Al Musayyab bahwa Jubair bin Muth'im telah menceritakan kepadanya bahwa ia dan Utsman datang kepada Rasulullah shallallahu 'alaihi wa sallam berbicara kepadanya mengenai apa yang beliau bagikan dari seperlima bagian pada perang Hunain antara Bani Hasyim dan Bani Al Muththalib bin abdu Manaf. Mereka berkata: wahai Rasulullah, engkau telah membagi untuk saudara-saudara kami yaitu Bani Al Muththalib bin Abdu Manaf dan tidak memberikan kepada kami sedikitpun, sedangkan kerabat kami seperti kerabat mereka. Kemudian Rasulullah shallallahu 'alaihi wa sallam bersabda kepada mereka: \"Sesungguhnya saya melihat Hasyim dan Al Muththalib sebagai sesuatu yang satu.\" Jubair berkata: Rasulullah shallallahu 'alaihi wa sallam tidak memberikan bagian untuk Bani Abdu Syams dan Bani Naufal dari seperlima tersebut sedikitpun sebagaimana beliau membagi untuk Hasyim dan Bani Al Muththalib."
            },
            {
                "number": 4068,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَلَمَّا قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَهْمَ ذِي الْقُرْبَى بَيْنَ بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ أَتَيْتُهُ أَنَا وَعُثْمَانُ بْنُ عَفَّانَ فَقُلْنَا يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو هَاشِمٍ لَا نُنْكِرُ فَضْلَهُمْ لِمَكَانِكَ الَّذِي جَعَلَكَ اللَّهُ بِهِ مِنْهُمْ أَرَأَيْتَ بَنِي الْمُطَّلِبِ أَعْطَيْتَهُمْ وَمَنَعْتَنَا فَإِنَّمَا نَحْنُ وَهُمْ مِنْكَ بِمَنْزِلَةٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُمْ لَمْ يُفَارِقُونِي فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ إِنَّمَا بَنُو هَاشِمٍ وَبَنُو الْمُطَّلِبِ شَيْءٌ وَاحِدٌ وَشَبَّكَ بَيْنَ أَصَابِعِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna], ia berkata; telah menceritakan kepada kami [Yazid bin Harun], ia berkata; telah memberitakan kepada kami [Muhammad bin Ishaq] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Jubair bin Muth'im], ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam membagi saham para kerabat antara Bani Hasyim dan Bani Al Muththalib, saya datang kepada beliau bersama Utsman bin Affan. Kami berkata; wahai Rasulullah, mereka orang-orang Bani Hasyim, kami tidak mengingkari keutamaan mereka karena posisimu yang Allah telah menjadikan dirimu yang telah Allah berikan kepadamu diantara mereka. Bagaimana pendapat anda mengenai Bani Al Muththalib, anda telah memberikan kepada mereka dan menahan kami, sesungguhnya kami dan mereka adalah satu tingkat di sisimu. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya mereka tidak meningalkan aku baik pada masa jahiliyah maupun Islam. Sesungguhnya Bani Hasyim dan Bani Al Muththalib adalah sesuatu yang satu.\" Dan beliau menjalin antara jari-jari tangannya. "
            },
            {
                "number": 4069,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا مَحْبُوبٌ يَعْنِي ابْنَ مُوسَى قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ وَهُوَ الْفَزَارِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ مَكْحُولٍ عَنْ أَبِي سَلَّامٍ عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ وَبَرَةً مِنْ جَنْبِ بَعِيرٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّهُ لَا يَحِلُّ لِي مِمَّا أَفَاءَ اللَّهُ عَلَيْكُمْ قَدْرُ هَذِهِ إِلَّا الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْقَالَ أَبُو عَبْد الرَّحْمَنِ اسْمُ أَبِي سَلَّامٍ مَمْطُورٌ وَهُوَ حَبَشِيٌّ وَاسْمُ أَبِي أُمَامَةَ صُدَيُّ بْنُ عَجْلَانَ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Mahbub yaitu Ibnu Musa], ia berkata; telah memberitakan kepada kami [Abu Ishaq yaitu Al Fazari] dari [Abdurrahman bin 'Ayyasy] dari [Sulaiman bin Musa] dari [Makhul] dari [Abu Sallam] dari [Abu Umamah Al Bahili] dari ['Ubadah bin Ash Shamit], ia berkata; Rasulullah shallallahu 'alaihi wasallam usai perang Hunain mengambil bulu di samping unta dan bersabda: \"wahai sekalian manusia, sesungguhnya tidak halal bagiku dari apa yang Allah berikan kepada kalian sebanyak rambut ini kecuali hanya seperlima, dan seperlima akan dikembalikan kepada kalian, \" Abu Abdurrahman berkata nama Abi Salam adalah Mamthur ia orang Habasyah dan nama Abu Umamah adalah Shudai bin 'Ajlan, wallahu ta'ala a'lam. "
            },
            {
                "number": 4070,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بَعِيرًا فَأَخَذَ مِنْ سَنَامِهِ وَبَرَةً بَيْنَ إِصْبَعَيْهِ ثُمَّ قَالَ إِنَّهُ لَيْسَ لِي مِنْ الْفَيْءِ شَيْءٌ وَلَا هَذِهِ إِلَّا الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ فِيكُمْ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yazid], ia berkata; telah menceritakan kepada kami [Ibnu Abi 'Adi], ia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Muhammad bin Ishaq] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam mendatangi seekor onta kemudian mengambil bulu dari punuknya diantara dua jarinya, kemudian bersabda: \"Sesungguhnya tidak ada sesutupun dari harta fai` ini untukku, dan tidak pula bulu ini kecuali seperlima dan seperlima dikembalikan kepada kalian.\""
            },
            {
                "number": 4071,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ عَنْ الزُّهْرِيِّ عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ عَنْ عُمَرَ قَالَ كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِمَّا لَمْ يُوجِفْ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلَا رِكَابٍ فَكَانَ يُنْفِقُ عَلَى نَفْسِهِ مِنْهَا قُوتَ سَنَةٍ وَمَا بَقِيَ جَعَلَهُ فِي الْكُرَاعِ وَالسِّلَاحِ عُدَّةً فِي سَبِيلِ اللَّهِ",
                "id": "Telah mengabarkan kepada kami 'Ubaid bin Sa'id, ia berkata: telah menceritakan kepada kami Sufyan dari 'Amr yaitu Ibnu Dinar dari Az Zuhri dari Malik bin Aus bin Al Hadatsan dari Umar, ia berkata: harta Bani Nadhir diantara yang diberikan Allah kepada RasulullahNya dari sesuatu yang tanpa pengerahan kuda dan unta oleh orang-orang muslim. Beliau menafkahi dirinya dari harta tersebut sebagai makanan satu tahun, dan sisanya beliau salurkan kepada kuda dan senjata sebagai perlengkapan di jalan Allah."
            },
            {
                "number": 4072,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا مَحْبُوبٌ يَعْنِي ابْنَ مُوسَى قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ هُوَ الْفَزَارِيُّ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ فَاطِمَةَ أَرْسَلَتْ إِلَى أَبِي بَكْرٍ تَسْأَلُهُ مِيرَاثَهَا مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ صَدَقَتِهِ وَمِمَّا تَرَكَ مِنْ خُمُسِ خَيْبَرَ قَالَ أَبُو بَكْرٍ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Mahbub yaitu Ibnu Musa], Ia berkata; telah memberitakan kepada kami [Abu Ishaq yaitu Al Fazari] dari [Syu'aib bin Abu Hamzah] dari [Az Zuhri] dari ['Urwah bin Az Zubair] dari [Aisyah] bahwa Fathimah mengirim surat kepada Abu Bakar menanyakan warisannya kepada Nabi shallallahu 'alaihi wasallam dari nafkahnya dan sebagian dari apa yang beliau tinggalkan dari bagian seperlima dari Khaibar. [Abu Bakar] berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami tidak diwarisi.\""
            },
            {
                "number": 4073,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى قَالَ حَدَّثَنَا مَحْبُوبٌ قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ عَنْ زَائِدَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍفِي قَوْلِهِ عَزَّ وَجَلَّ{ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى }قَالَ خُمُسُ اللَّهِ وَخُمُسُ رَسُولِهِ وَاحِدٌ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْمِلُ مِنْهُ وَيُعْطِي مِنْهُ وَيَضَعُهُ حَيْثُ شَاءَ وَيَصْنَعُ بِهِ مَا شَاءَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya], ia berkata; telah menceritakan kepada kami [Mahbub], ia berkata; telah memberitakan kepada kami [Abu Ishaq] dari [Zaidah] dari [Abdul Malik bin Abu Sulaiman] dari ['Atha`] mengenai firman Allah \"azza wa jalla: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul. Ia berkata; seperlima untuk Allah dan rasulNya adalah satu, dulu Rasulullah shallallahu 'alaihi wasallam membawa darinya, memberi darinya dan meletakkannya dimana beliau mau dan berbuat dengannya apa yang beliau mau."
            },
            {
                "number": 4074,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا مَحْبُوبٌ يَعْنِي ابْنَ مُوسَى قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ هُوَ الْفَزَارِيُّ عَنْ سُفْيَانَ عَنْ قَيْسِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ الْحَسَنَ بْنَ مُحَمَّدٍ عَنْ قَوْلِهِ عَزَّ وَجَلَّ { وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ } قَالَ هَذَا مَفَاتِحُ كَلَامِ اللَّهِ الدُّنْيَا وَالْآخِرَةُ لِلَّهِ قَالَ اخْتَلَفُوا فِي هَذَيْنِ السَّهْمَيْنِ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَهْمِ الرَّسُولِ وَسَهْمِ ذِي الْقُرْبَى فَقَالَ قَائِلٌ سَهْمُ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْخَلِيفَةِ مِنْ بَعْدِهِ وَقَالَ قَائِلٌ سَهْمُ ذِي الْقُرْبَى لِقَرَابَةِ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ قَائِلٌ سَهْمُ ذِي الْقُرْبَى لِقَرَابَةِ الْخَلِيفَةِ فَاجْتَمَعَ رَأْيُهُمْ عَلَى أَنْ جَعَلُوا هَذَيْنِ السَّهْمَيْنِ فِي الْخَيْلِ وَالْعُدَّةِ فِي سَبِيلِ اللَّهِ فَكَانَا فِي ذَلِكَ خِلَافَةَ أَبِي بَكْرٍ وَعُمَرَ",
                "id": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata: telah menceritakan kepada kami Mahbub yaitu Ibnu Musa, ia berkata: telah memberitakan kepada kami Abu Ishaq yaitu Al Fazari dari Sufyan dari Qais bin Muslim, ia berkata: saya bertanya kepada Al Hasan bin Muhammad mengenai firman Allah Azza wa jalla: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, ia berkata ini adalah kunci firman Allah, dunia dan akhirat adalah milik Allah. Ia berkata: mereka berselisih mengenai kedua saham ini setelah wafatnya Rasulullah shallallahu 'alaihi wa sallam, yaitu saham rasul dan saham kerabat beliau, seseorang berkata: saham Rasulullah shallallahu 'alaihi wa sallam adalah untuk khalifah setelah beliau, seseorang berkata: saham kaum kerabat adalah untuk kerabat Rasulullah shallallahu 'alaihi wa sallam dan seseorang berkata: saham kaum kerabat adalah untuk kerabat khalifah, kemudian pendapat mereka bersepakat untuk menajadikan dua saham ini untuk kuda dan perlengkapan perang di jalan Allah, kedua hal itu terjadi pada masa Abu Bakar dan Umar."
            },
            {
                "number": 4075,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا مَحْبُوبٌ قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ قَالَ سَأَلْتُ يَحْيَى بْنَ الْجَزَّارِعَنْ هَذِهِ الْآيَةِ{ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ }قَالَ قُلْتُ كَمْ كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْخُمُسِ قَالَ خُمُسُ الْخُمُسِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Mahbub], ia berkata; telah memberitakan kepada kami [Abu Ishaq] dari [Musa bin Abu 'Aisyah] ia berkata; saya bertanya kepada [Yahya bin Al Jazzar] tentang ayat ini: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul. Ia berkata aku berkata; berapa jatah untuk Nabi shallallahu 'alaihi wasallam dari seperlima itu? Ia menjawab seperlima dari seperlima."
            },
            {
                "number": 4076,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا مَحْبُوبٌ قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ عَنْ مُطَرِّفٍ قَالَ سُئِلَ الشَّعْبِيُّعَنْ سَهْمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَفِيِّهِ فَقَالَ أَمَّا سَهْمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَسَهْمِ رَجُلٍ مِنْ الْمُسْلِمِينَ وَأَمَّا سَهْمُ الصَّفِيِّ فَغُرَّةٌ تُخْتَارُ مِنْ أَيِّ شَيْءٍ شَاءَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Mahbub], ia berkata; telah memberitakan kepada kami [Abu Ishaq] dari [Mutharrif] ia berkata; [Asy Sya'bi] ditanya mengenai saham Nabi shallallahu 'alaihi wasallam dan pilihan beliau, ia menjawab adapun saham Nabi shallallahu 'alaihi wasallam seperti jatah seorang dari kaum muslimin dan harta pilihannya adalah budak yang dipilih sesuai keinginannya. "
            },
            {
                "number": 4077,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى قَالَ حَدَّثَنَا مَحْبُوبٌ قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ يَزِيدَ بْنِ الشِّخِّيرِ قَالَبَيْنَا أَنَا مَعَ مُطَرِّفٍ بِالْمِرْبَدِ إِذْ دَخَلَ رَجُلٌ مَعَهُ قِطْعَةُ أَدَمٍ قَالَ كَتَبَ لِي هَذِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلْ أَحَدٌ مِنْكُمْ يَقْرَأُ قَالَ قُلْتُ أَنَا أَقْرَأُ فَإِذَا فِيهَا مِنْ مُحَمَّدٍ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِبَنِي زُهَيْرِ بْنِ أُقَيْشٍ أَنَّهُمْ إِنْ شَهِدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَفَارَقُوا الْمُشْرِكِينَ وَأَقَرُّوا بِالْخُمُسِ فِي غَنَائِمِهِمْ وَسَهْمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَفِيِّهِ فَإِنَّهُمْ آمِنُونَ بِأَمَانِ اللَّهِ وَرَسُولِهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya], ia berkata; telah menceritakan kepada kami [Mahbub], ia berkata; telah memberitakan kepada kami [Abu Ishaq] dari [Sa'id Al Jurairi] dari [Yazid bin Syikhir] ia berkata; ketika saya bersama Mutharrif di tempat dikumpulkannya kurma tiba-tiba datanglah [seseorang] yang membawa potongan kulit, ia berkata Rasulullah shallallahu 'alaihi wasallam menuliskan ini untukku, adakah diantara kalian yang bisa membaca, saya menjawab; saya bisa membaca, ternyata didalamnya: \"dari Muhammad seorang Nabi shallallahu 'alaihi wasallam untuk Bani Zuhair bin Aqaisy bahwa jika mereka bersaksi bahwa tiada Tuhan yang berhak disembah kecuali hanya Allah dan Muhammad adalah Rasulullah dan mereka meninggalkan orang-orang musyrik, dan menetapkan seperlima pada harta rampasan mereka dan saham Nabi shallallahu 'alaihi wasallam serta pilihannya maka sesungguhnya mereka aman dengan keamanan dari Allah dan RasulNya.\""
            },
            {
                "number": 4078,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ أَنْبَأَنَا مَحْبُوبٌ قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ عَنْ شَرِيكٍ عَنْ خُصَيْفٍ عَنْ مُجَاهِدٍ قَالَ الْخُمُسُ الَّذِي لِلَّهِ وَلِلرَّسُولِ كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَرَابَتِهِ لَا يَأْكُلُونَ مِنْ الصَّدَقَةِ شَيْئًا فَكَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُمُسُ الْخُمُسِ وَلِذِي قَرَابَتِهِ خُمُسُ الْخُمُسِ وَلِلْيَتَامَى مِثْلُ ذَلِكَ وَلِلْمَسَاكِينِ مِثْلُ ذَلِكَ وَلِابْنِ السَّبِيلِ مِثْلُ ذَلِكَ قَالَ أَبُو عَبْد الرَّحْمَنِ قَالَ اللَّهُ جَلَّ ثَنَاؤُهُ { وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ } وَقَوْلُهُ عَزَّ وَجَلَّ لِلَّهِ ابْتِدَاءُ كَلَامٍ لِأَنَّ الْأَشْيَاءَ كُلَّهَا لِلَّهِ عَزَّ وَجَلَّ وَلَعَلَّهُ إِنَّمَا اسْتَفْتَحَ الْكَلَامَ فِي الْفَيْءِ وَالْخُمُسِ بِذِكْرِ نَفْسِهِ لِأَنَّهَا أَشْرَفُ الْكَسْبِ وَلَمْ يَنْسِبْ الصَّدَقَةَ إِلَى نَفْسِهِ عَزَّ وَجَلَّ لِأَنَّهَا أَوْسَاخُ النَّاسِ وَاللَّهُ تَعَالَى أَعْلَمُ وَقَدْ قِيلَ يُؤْخَذُ مِنْ الْغَنِيمَةِ شَيْءٌ فَيُجْعَلُ فِي الْكَعْبَةِ وَهُوَ السَّهْمُ الَّذِي لِلَّهِ عَزَّ وَجَلَّ وَسَهْمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْإِمَامِ يَشْتَرِي الْكُرَاعَ مِنْهُ وَالسِّلَاحَ وَيُعْطِي مِنْهُ مَنْ رَأَى مِمَّنْ رَأَى فِيهِ غَنَاءً وَمَنْفَعَةً لِأَهْلِ الْإِسْلَامِ وَمِنْ أَهْلِ الْحَدِيثِ وَالْعِلْمِ وَالْفِقْهِ وَالْقُرْآنِ وَسَهْمٌ لِذِي الْقُرْبَى وَهُمْ بَنُو هَاشِمٍ وَبَنُو الْمُطَّلِبِ بَيْنَهُمْ الْغَنِيُّ مِنْهُمْ وَالْفَقِيرُ وَقَدْ قِيلَ إِنَّهُ لِلْفَقِيرِ مِنْهُمْ دُونَ الْغَنِيِّ كَالْيَتَامَى وَابْنِ السَّبِيلِ وَهُوَ أَشْبَهُ الْقَوْلَيْنِ بِالصَّوَابِ عِنْدِي وَاللَّهُ تَعَالَى أَعْلَمُ وَالصَّغِيرُ وَالْكَبِيرُ وَالذَّكَرُ وَالْأُنْثَى سَوَاءٌ لِأَنَّ اللَّهَ عَزَّ وَجَلَّ جَعَلَ ذَلِكَ لَهُمْ وَقَسَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ وَلَيْسَ فِي الْحَدِيثِ أَنَّهُ فَضَّلَ بَعْضَهُمْ عَلَى بَعْضٍ وَلَا خِلَافَ نَعْلَمُهُ بَيْنَ الْعُلَمَاءِ فِي رَجُلٍ لَوْ أَوْصَى بِثُلُثِهِ لِبَنِي فُلَانٍ أَنَّهُ بَيْنَهُمْ وَأَنَّ الذَّكَرَ وَالْأُنْثَى فِيهِ سَوَاءٌ إِذَا كَانُوا يُحْصَوْنَ فَهَكَذَا كُلُّ شَيْءٍ صُيِّرَ لِبَنِي فُلَانٍ أَنَّهُ بَيْنَهُمْ بِالسَّوِيَّةِ إِلَّا أَنْ يُبَيِّنَ ذَلِكَ الْآمِرُ بِهِ وَاللَّهُ وَلِيُّ التَّوْفِيقِ وَسَهْمٌ لِلْيَتَامَى مِنْ الْمُسْلِمِينَ وَسَهْمٌ لِلْمَسَاكِينِ مِنْ الْمُسْلِمِينَ وَسَهْمٌ لِابْنِ السَّبِيلِ مِنْ الْمُسْلِمِينَ وَلَا يُعْطَى أَحَدٌ مِنْهُمْ سَهْمُ مِسْكِينٍ وَسَهْمُ ابْنِ السَّبِيلِ وَقِيلَ لَهُ خُذْ أَيَّهُمَا شِئْتَ وَالْأَرْبَعَةُ أَخْمَاسٍ يَقْسِمُهَا الْإِمَامُ بَيْنَ مَنْ حَضَرَ الْقِتَالَ مِنْ الْمُسْلِمِينَ الْبَالِغِينَ",
                "id": "Telah mengabarkan kepada kami 'Amr bin Yahya bin Al Harits, ia berkata: telah memberitakan kepada kami Mahbub, ia berkata: telah memberitakan kepada kami Abu Ishaq dari Syarik dari Khushaif dari Mujahid ia berkata: seperlima yang untuk Allah dan Rasul, adalah untuk Nabi shallallahu 'alaihi wa sallam dan kerabatnya mereka tidak memakan harta sedekah sedikitpun. Maka untuk Nabi shallallahu 'alaihi wa sallam seperlima dari seperlima dan untuk keluarganya seperlima dari seperlima, untuk anak-anak yatim seperti itu, untuk orang-orang miskin seperti itu, dan untuk Ibn sabil seperti itu, Abu Abdurrahman berkata: Allah: Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan ibnussabil dan firmanNya Azza wa jalla untuk Allah adalah permulaan perkataan karena segala sesuatu adalah milik Allah Azza wa jalla dan barangkali firman tentang Fai` dan seperlima ini dimulai dengan penyebutan diriNya karena hal itu adalah sebaik-mata pencaharian dan Allah tidak menisbatkan sedekah kepada diriNya Azza wa jalla karena ia adalah kotoran manusia, wallahua'lam, dan dikatakan bahwa dari harta rampasan itu diambil sedikit kemudian diperuntukkan untuk Ka'bah dan itulah bagian untuk Allah sedangkan saham untuk Nabi shallallahu 'alaihi wa sallam diberikan kepada seorang pemimpin ia membeli hewan tunggangan dan senjata serta ia memberikan darinya siapa saja yang ia pandang membutuhkan dan bermanfaat bagi orang Islam, atau ahli hadits, ilmu, fiqh dan Al Qur'an, adapun saham untuk kerabat beliau, yaitu Bani Hasyim dan AbdUl Muththalib diantara mereka yang kaya dan fakir, dan dikatakan bahwa saham itu hanya untuk yang fakir saja tanpa orang-orang kaya, seperti anak yatim dan Ibn Sabil dan itu adalah perkataan yang paling mendekati kebenaran menurutku wallahu Ta'ala a'lam. Anak kecil, orang dewasa, laki-laki maupun perempuan sama karena Allah Azza wa jalla memberikan hal itu untuk mereka, dan Rasulullah shallallahu 'alaihi wa sallam membaginya diantara mereka, tidak disebutkan dalam hadits bahwa beliau beliau mengutamakan yang lain diatas sebagian yang lain, tidak ada perselisihan yang kami ketahui dari para Ulama mengenai seseorang apabila ia mewasiatkan sepertiga hartanya untuk Bani Fulan bahwa harta tersebut dibagi diantara mereka dan untuk laki-laki serta perempuan mendapatkan bagian yang sama, demikian juga jika keseluruhan diberikan kepada Bani Fulan maka mereka mendapatkan jatah yang sama, kecuali jika orang yang memerintahkan menjelaskan hal tersebut. Dan satu bagian untuk anak-anak yatim dari kaum muslimin, satu bagian untuk orang-orang miskin dari kaum muslimin, satu bagian untuk Ibn Sabil dari kaum muslimin, dan tidak seorang dari mereka yang diberi saham orang miskin atau Ibn sabil dan dikatakan kepadanya: ambillah mana yang engkau inginkan, sedangkan empat perlima bagian dibagi oleh imam diantara orang yang mengikuti perang yang sudah baligh."
            },
            {
                "number": 4079,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ قَالَ جَاءَ الْعَبَّاسُ وَعَلِيٌّ إِلَى عُمَرَ يَخْتَصِمَانِ فَقَالَ الْعَبَّاسُ اقْضِ بَيْنِي وَبَيْنَ هَذَا فَقَالَ النَّاسُ افْصِلْ بَيْنَهُمَا فَقَالَ عُمَرُ لَا أَفْصِلُ بَيْنَهُمَا قَدْ عَلِمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ قَالَ فَقَالَ الزُّهْرِيُّ وَلِيَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَ مِنْهَا قُوتَ أَهْلِهِ وَجَعَلَ سَائِرَهُ سَبِيلَهُ سَبِيلَ الْمَالِ ثُمَّ وَلِيَهَا أَبُو بَكْرٍ بَعْدَهُ ثُمَّ وُلِّيتُهَا بَعْدَ أَبِي بَكْرٍ فَصَنَعْتَ فِيهَا الَّذِي كَانَ يَصْنَعُ ثُمَّ أَتَيَانِي فَسَأَلَانِي أَنْ أَدْفَعَهَا إِلَيْهِمَا عَلَى أَنْ يَلِيَاهَا بِالَّذِي وَلِيَهَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي وَلِيَهَا بِهِ أَبُو بَكْرٍ وَالَّذِي وُلِّيتُهَا بِهِ فَدَفَعْتُهَا إِلَيْهِمَا وَأَخَذْتُ عَلَى ذَلِكَ عُهُودَهُمَا ثُمَّ أَتَيَانِي يَقُولُ هَذَا اقْسِمْ لِي بِنَصِيبِي مِنْ ابْنِ أَخِي وَيَقُولُ هَذَا اقْسِمْ لِي بِنَصِيبِي مِنْ امْرَأَتِي وَإِنْ شَاءَا أَنْ أَدْفَعَهَا إِلَيْهِمَا عَلَى أَنْ يَلِيَاهَا بِالَّذِي وَلِيَهَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي وَلِيَهَا بِهِ أَبُو بَكْرٍ وَالَّذِي وُلِّيتُهَا بِهِ دَفَعْتُهَا إِلَيْهِمَا وَإِنْ أَبَيَا كُفِيَا ذَلِكَ ثُمَّ قَالَ { وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ } هَذَا لِهَؤُلَاءِ { إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ } هَذِهِ لِهَؤُلَاءِ { وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ } قَالَ الزُّهْرِيُّ هَذِهِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاصَّةً قُرًى عَرَبِيَّةً فَدْكُ كَذَا وَكَذَا فَ { مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْ أَهْلِ الْقُرَى فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ } وَ { لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ } { وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِنْ قَبْلِهِمْ } { وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ } فَاسْتَوْعَبَتْ هَذِهِ الْآيَةُ النَّاسَ فَلَمْ يَبْقَ أَحَدٌ مِنْ الْمُسْلِمِينَ إِلَّا لَهُ فِي هَذَا الْمَالِ حَقٌّ أَوْ قَالَ حَظٌّ إِلَّا بَعْضَ مَنْ تَمْلِكُونَ مِنْ أَرِقَّائِكُمْ وَلَئِنْ عِشْتُ إِنْ شَاءَ اللَّهُ لَيَأْتِيَنَّ عَلَى كُلِّ مُسْلِمٍ حَقُّهُ أَوْ قَالَ حَظُّهُ",
                "id": "Telah mengabarkan kepada kami Ali bin Hujr, ia berkata: telah menceritakan kepada kami Isma'il yaitu Ibnu Ibrahim dari Ayyub dari Ikrimah bin Khalid dari Malik bin Aus bin Al Hadatsan, ia berkata: telah datang Al Abbas dan Ali kepada Umar, mereka sedang berselisih. Al Abbas berkata: putuskan antara diriku dan orang ini. Kemudian orang-orang berkata: putuskan antara mereka berdua! Kemudian Umar berkata: Saya tidak akan memutuskan diantara mereka, sungguh mereka telah mengetahui bahwa Rasulullah shallallahu 'alaihi wa sallam berkata: \"Kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah.\" Aus berkata: Az Zuhri berkata: Rasulullah shallallahu 'alaihi wa sallam mengurusinya maka beliau mengambil darinya makan untuk keluarganya dan menjadikan penyaluran selebihnya adalah penyaluran harta. Kemudian diurusi oleh Abu Bakar setelahnya kemudian saya yang diminta untuk mengurusinya setelah Abu Bakar dan saya melakukan apa yang ia lakukan, kemudian mereka berdua datang kepadaku dan memintaku untuk menyerahkannya kepada mereka berdua agar mereka yang mengurusinya sebagaimana Rasulullah shallallahu 'alaihi wa sallam mengurusinya serta sebagaimana Abu Bakar mengurusinya serta yang saya urusi. Kemudian saya menyerahkannya kepada mereka berdua dan saya mengambil janji dari mereka. Kemudian mereka datang kepadaku, yang ini mengatakan: bagikan untukku bagiku dari saudaraku, dan yang ini mengatakan: bagikan untukku bagiku dari isteriku. Apabila mereka berdua ingin agar saya menyerahkannya kepada mereka agar mereka mengurusinya sebagaimana Rasulullah shallallahu 'alaihi wa sallam mengurusi dan sebagaimana Abu Bakar mengurusi serta sebagaimana saya mengurusi maka saya akan menyerahkannya kepada mereka, dan jika mereka menolak maka cukuplah hal tersebut bagi mereka. Kemudian ia berkata: \"Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang, maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan ibnussabil. Ini untuk mereka, Sesungguhnya zakat-zakat itu, hanyalah untuk orang-orang fakir, orang-orang miskin, pengurus-pengurus zakat, para mu'allaf yang dibujuk hatinya, untuk (memerdekakan) budak, orang-orang yang berhutang, untuk jalan Allah dan untuk mereka yuang sedang dalam perjalanan dan ini untuk mereka. Dan apa saja harta rampasan (fai-i) yang diberikan Allah kepada RasulNya (dari harta benda) mereka, maka untuk mendapatkan itu kamu tidak mengerahkan seekor kudapun dan (tidak pula) seekor untapun.\" Az Zuhri mengatakan: ini adalah untuk Rasulullah shallallahu 'alaihi wa sallam secara khusus kampung-kampung Arab, tempat ini dan tempat ini.\"Apa saja harta rampasan (fai-i) yang diberikan Allah kepada RasulNya (dari harta benda) yang berasal dari penduduk kota-kota maka adalah untuk Allah, untuk Rasul, kaum kerabat, anak-anak yatim, orang-orang miskin dan orang-orang yang dalam perjalanan.\" \"Bagi orang fakir yang berhijrah yang diusir dari kampung halaman dan dari harta benda mereka.\" \"Dan orang-orang yang telah menempati kota Madinah dan telah beriman (Anshor) sebelum (kedatangan) mereka (Muhajirin).\" \"Dan orang-orang yang datang sesudah mereka (Muhajirin dan Anshor).\" Ayat ini mencakup seluruh manusia tidak tertinggal seorang muslimpun melainkan ia memiliki hak dalam harta ini, kecuali sebagian apa yang kalian miliki berupa budak-budak kalian. Sungguh seandainya saya hidup insya Allah niscaya akan datang kepada setiap muslim haknya."
            }
  ]
}